[{
  "_id": {
    "$oid": "6698e6db71b3d93d7c8781e4"
  },
  "companyname": "CyberSocial",
  "Type": "Web Development",
  "Location": "Remote",
  "Responsibilities": "Selected interns day-to-day responsibilities include:Working with HTML,CSS, JS and MySQL to design, develop and debug web applications.Ocassionally Work on WordPress development.Developing a new highly responsive and web-based user interface.Integrating back-end services with PHP/JavaScript based front-end needs.Working with the team to manage, optimize and customize multiple web applications.Creating and maintaining technical documentation.Developing a flexible and well-structured front-end architecture along with the APIs to support it.Monitoring the performance of the live website.Boost website loading performance with SEO and Google Analytics.",
  "Qualifications": "Superior written and verbal communication skills, with a keen eye for detail.\r\nProven ability to quickly learn and understand complex topicsPrevious experience. writing notes and procedural materials for cases.\r\nFreshers are also eligible to apply.\r\nEnrolled in Bachelor’s degree/Master's degree program currently as student.",
  "about": "We help people and LEA's to identify, prevent, detect, and solve crime cases, frauds and acts of cyber terrorism/national security threats comprising usage of any forensic artifacts in our personal and professional lives. We also help to educate people regarding cyber-crime and bring awareness regarding proper reporting of cyber-crimes and organize trainings for LEA for handling forensic evidences, conducting investigation and proactive intelligence to curb cyber-crime. We look forward to provide good justice system in India and enhancing investigation methodologies by educating about forensic good practices and skill development in digital and physical forensics. we also aim in eradicating crime from cyber space to make it a safer platform for everyone. Our team is ready and equipped to protect you from any crime and bring peace to you by getting such people .",
  "Link": "https://www.linkedin.com/company/cybersocial4u/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "6698e8a971b3d93d7c8781e5"
  },
  "companyname": "Gigsgen Digital Innovations",
  "Type": "Web Development",
  "Location": "Remote",
  "Responsibilities": "This is a contract, remote Software Development Freelancer role. The successful candidates will be responsible for developing, testing, and implementing unique software solutions for our clients. They will work closely with cross-functional teams to ensure the successful delivery of high-quality software that meets client expectations. They must be able to problem solve, think creatively, and be self-motivated whilst also being able to work collaboratively with our other freelancers.",
  "Qualifications": "Experience in full software development lifecycle using software engineering principles of analysis, design, testing, and programming.Experience with programming languages such as Python,Java, C#, and JavaScript as well as an understanding of platform concepts and technologies, including frameworks and databases.Capable of understanding complex concepts and able to work successfully in a customer-facing environment, on large and highly visible development projects requiring creativity and strong capability in problem solving, coding, testing, and debugging.Ability to work effectively and efficiently with multiple programming languages to build various types of solutions and also work cross-functionally within collaborative teams to troubleshoot and solve business issues.Bachelor's degree in Computer Science, Computer Engineering or equivalent practical experience in software development.Fluent in English language (written and verbal)",
  "about": "Welcome to Gigsgen.The premier freelance marketplace that specializes in Business Process Automation, Robotics Process Automation, and AI-Based Automation. We are dedicated to providing exceptional freelancing services across a wide range of domains to help businesses thrive in the digital age.This platform is designed to connect businesses with top-tier freelance talent who possess the expertise and experience to implement these transformative technologies. By partnering with our freelancers, you gain access to a global talent pool of professionals who excel in driving automation, delivering innovative solutions, and optimizing your business processes.At Gigsgen, we understand the importance of streamlining business processes to enhance productivity and efficiency.",
  "Link": "https://www.linkedin.com/company/gigsgen-digital-innovations/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "6698e95971b3d93d7c8781e6"
  },
  "companyname": "CodersBrain",
  "Type": "Web Development",
  "Location": "On Site",
  "Responsibilities": "Work closely with the tech lead and product owner to help architect the overall application.Implement product features in exemplary, efficient code that can serve as a model for developers less familiar with new technologies.Participate in stakeholder meetings and provide technical input related to Scala and REST APIs to help resolve issues and support customer success.Counsel the team when making framework-specific technology decisions.Review code submissions with an eye towards building a high-quality and sustainable codebase.Alongside the team, maintain and extend the application according to business requirements.Ensure applications and services are secure and meet industry standards for data privacy and protection.",
  "Qualifications": "Bachelors in engineering (B.E./ B.Tech Degree) with 5+ years in a full-stack web development position.Strong technical skills in Scala, Javascript, HTML, and REST APIs, including knowledge of development frameworks, REST API design principles, and API documentation tools (such as Swagger or RAML).Proven experience implementing API authentication, authorization, and rate limiting.Expert-level skill with RESTful services, both as a user and as an author.Excellent problem-solving skills and ability to troubleshoot complex technical issues related to Scala, Javascript, and REST APIs.Demonstrated experience with RDS, MySQL, MongoDB, and Elasticsearch databases.Comfortable using the tools of modern collaborative Agile+Scrum SDLC, including Git, Jira, planning poker, etc.Highly proficient in English with excellent oral and written communication skills.",
  "about": "Coders Brain is a global leader in IT services, digital and business solutions that partners with its clients to simplify, strengthen and transform their businesses. We ensure the highest levels of certainty and satisfaction through a deep-set commitment to our clients, comprehensive industry expertise and a global network of innovation and delivery centers.",
  "Link": "https://www.linkedin.com/company/codersbrain/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "6698e9cf71b3d93d7c8781e7"
  },
  "companyname": "Football Experience LTD",
  "Type": "Web Development",
  "Location": "Remote",
  "Responsibilities": "This is a full-time remote role for a Web Programmer. The candidate will be responsible for the development and maintenance of our platform, which consists of a backend in Laravel and several frontends in Next.js + GraphQL. This includes ensuring the operational efficiency of the platform, maintaining the website's security, and deploying innovative features.",
  "Qualifications": "Expertise in Back-End Web Development and Programming.A minimum of 4 years of experience in Web Development and Front-End Development.Proficiency in programming languages such as PHP (Laravel), React, and Next.js, with a strong understanding of GraphQL.Solid knowledge of Object-Oriented Programming (OOP) and software architecture.",
  "about": "Football Experience LTD is one of the leading global secondary marketplaces (based in Spain) for football tickets. We ensure that football fans have access to the best seats at the best prices. As a trusted platform, we guarantee that prices are subject to sellers and may be below or above face value. Our services are utilized by fans all over the world who are passionate about their favorite football teams",
  "Link": "https://www.linkedin.com/company/football-experience-ltd/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "6698ea6c71b3d93d7c8781e8"
  },
  "companyname": "FuziXel Technologies",
  "Type": "Web Development",
  "Location": "Remote",
  "Responsibilities": "Design, develop, and maintain websites using HTML, CSS, JavaScript, and other web development technologies.Work with content management systems (CMS) such as WordPress, Joomla, or Drupal to create and manage website content.Develop custom themes and plugins for WordPress or other CMS platforms.Ensure websites are responsive, user-friendly, and optimized for various devices and browsers.Collaborate with designers, content creators, and other team members to bring web projects to life.Implement SEO best practices to improve website visibility and search engine rankings.Troubleshoot and resolve website issues, including bugs, performance problems, and security vulnerabilities.Stay up-to-date with the latest web development trends, tools, and technologies.",
  "Qualifications": "Proven experience as a Website Developer or similar role.Proficiency in front-end technologies such as HTML, CSS, JavaScript, and responsive design.Experience with back-end development and server-side languages such as PHP, Python, Ruby, or Node.js.Strong knowledge of content management systems (CMS) like WordPress, Joomla, or Drupal.",
  "about": "We are a pioneer in the realm of Professional Services and Enterprise Content Management (ECM) solutions. We specialize in seamlessly integrating cutting-edge xECM solutions across various platforms, including SAP, SuccessFactors, Engineering systems, and beyond. We don’t just limit to Content Services, but we also offer various services on technologies like Artificial Intelligence and Machine Learning, Data Science, DevOps, Cloud Computing , full stack web development.",
  "Link": "https://www.linkedin.com/company/fuzixel-technologies/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "6698eb6771b3d93d7c8781e9"
  },
  "companyname": "Internkaksha IT Solutions",
  "Type": "Web Development",
  "Location": "Remote",
  "Responsibilities": "sRevise, edit, proofread & optimize web contentWork.cross-functionally to enhance overall user experience of our platform.Own various design tasks involved in the web development life cycle from start to finish",
  "Qualifications": "Bachelor's degree or equivalent experience in Computer Science.At least 1 - 2 years' of experience using HTML, CSS, and JavaScript.Proficiency in at least one server-side technology (Java, PHP, NodeJS, Python, Ruby).Ability to multi-task, organize, and prioritize work",
  "about": "Intern Kaksha is dedicated to creating innovative IT solutions and offering IT-enabled services that not only meet but delight our customers worldwide. We're all about building relationships based on trust, values, and professionalism.With specialization in various industry sectors including Technology, Finance, Healthcare, Media, Manufacturing, and many more, we bring industry-specific software expertise to the table. Our core offerings encompass Data & Analytics, Automation AI, IoT Services, Web Designing, Web Application Development, Mobile Application Development, Software Development, Digital Marketing, Software Testing, Quality Assurance services, and more.",
  "Link": "https://www.linkedin.com/company/intern-kaksh/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "6698ec5a71b3d93d7c8781ea"
  },
  "companyname": "ReBid",
  "Type": "Web Development",
  "Location": "Hybrid",
  "Responsibilities": "Work on the development of a new highly responsive & web-based user interface.Construct visualizations to depict vast amounts of data.Work and collaborate with the rest of the engineering team.Work with product team and graphic designers.Create and maintain software documentation.Be responsible for maintaining website.Stay plugged into emerging technologies/industry trends and apply them into operations and activities",
  "Qualifications": "01 years of relevant experience.Excellent knowledge in React JS.In-depth knowledge of JavaScript, CSS, HTML, and front-end languages.Knowledge of REACT tools including React.js, Webpack, Enzyme, Redux, and Flux.Experience with user interface design.Knowledge of performance testing frameworks including Mocha and Jest.Experience with browser-based debugging and performance testing software.Excellent troubleshooting skills.Good project management skills.Ability to work and thrive in a fast-paced environment, learn rapidly and master diverse technologies and techniques.Knowledge of Databases such as SQL, PostgreSQL would be added advantage.Knowledge of cloud technologies would be an added advantage",
  "about": "Founded by entrepreneur Rajiv Dingra, ReBid is a technology company offering transformational.martech, adtech, and deep tech products and solutions to drive creative, media, data, and business.transformation, helping global businesses become real-time, disruptive, and thereby achieve exponentialgrowth. We are a geography agnostic, hybrid work culture, and agile company which is focused on a forward-looking work culture. We have some of the best industry talents on board and we identify",
  "Link": "https://www.linkedin.com/company/rebid-co/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "6698ee6a71b3d93d7c8781eb"
  },
  "companyname": "Power Recruitment",
  "Type": "Web Development",
  "Location": "Hybrid",
  "Responsibilities": "Work on the development of a new highly responsive & web-based user interface.Construct visualizations to depict vast amounts of data.Work and collaborate with the rest of the engineering team.Work with product team and graphic designers.Create and maintain software documentation.Be responsible for maintaining website.Stay plugged into emerging technologies/industry trends and apply them into operations and activities",
  "Qualifications": "Collaborate with the development team to design, develop, and maintain company websites and web applications.Write clean, efficient, and well-documented code using HTML, CSS, JavaScript, and other relevant technologies.Conduct testing and debugging to ensure optimal functionality and user experience across various browsers and devices.Assist in the integration of third-party APIs and services to enhance website functionality.Stay updated on emerging technologies and industry trends to contribute innovative ideas and solutions.Support website content updates, including text, images, and multimedia elements.Participate in code reviews and provide constructive feedback to peers to maintain code quality and standards.Troubleshoot technical issues and provide timely resolutions to ensure uninterrupted website operation.Assist in optimizing website performance, including page load times and responsiveness.Collaborate with cross-functional teams, such as design and marketing, to align on project goals and requirements, fostering a positive and collaborative environment.",
  "about": "Power Recruitment Inc. is a full-service professional staffing and recruitment firm. The vision of our company is to provide the right candidate for the right job. We have been assisting businesses by providing top-tier talent, allowing them to succeed and grow. We have over a decade of experience assisting businesses in finding the right candidate.",
  "Link": "https://www.linkedin.com/company/powerrecruitment/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "6698ef7c71b3d93d7c8781ec"
  },
  "companyname": "Norstella",
  "Type": "Web Development",
  "Location": "Hybrid",
  "Responsibilities": "Develop, test, and deploy high-quality web applications for internal use.Design and maintain interactive user interfaces using Core JS, HTML, and CSS.Enhance and modify existing demo websites to incorporate GenAI functionalities, particularly for chat purposes.Optionally utilize Python for backend development, where beneficial (can also be done in typescript).Integrate Norstella’s data science APIs, including AWS API Gateway and Lambda functions.Utilise WebSockets and REST APIs to ensure smooth and efficient communication between front-end and back-end systems.Collaborate with internal stakeholders to gather requirements and ensure the solutions meet business needs.Provide technical guidance and mentorship to junior developers when necessary",
  "Qualifications": "Experience: 7+ years in web development with a strong focus on Core JS, HTML, and CSS.Technical Skills: Proficiency in using Python is beneficial but not mandatory.APIs and AWS Hands-on experience with API integration, particularly AWS API Gateway and Lambda functions.Web Communication: Experience with WebSockets and REST APIs.Problem-Solving: Ability to work independently, troubleshoot issues, and design solutions on the go.Adaptability: Comfortable modifying existing demo websites to suit new requirements, particularly for GenAI applications.",
  "about": "Norstella is a group of prominent pharmaceutical solutions providers – Citeline, Evaluate, MMIT, Panalgo, The Dedham Group – that help clients navigate complexities at each step of the drug development life cycle, from pipeline to patient.",
  "Link": "https://www.linkedin.com/company/norstellacompany/life/3223834d-d933-4c21-a470-9566e843b461/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "6698f08671b3d93d7c8781ed"
  },
  "companyname": "Acceron",
  "Type": "Web Development",
  "Location": "Hybrid",
  "Responsibilities": "Hands-on with UI Technologies experience.Extensive knowledge of JavaScript, web stacks, libraries, and frameworks.Knowledge of front-end technologies such as HTML5 and CSS3, React.Knowledge of CMS like WordPress, Webflow, and Shopify.good communication, and collaboration skills.Exceptional analytical and problem-solving aptitude.Great organizational and time management skills.",
  "Qualifications": "Understand business problems and provide design solutions.Experts' proficiency with design tools such as: Canva & Figma.Writing JavaScript, CSS, and HTML.Creating user flows, wireframes, prototypes and mockups.Ability to communicate clearly with the developer, design and the marketing team.Strategic approach to problem-solving and ability to think far beyond the user interface.Conduct usability testing to resolve interface issues.Adapting interface for modern internet applications using the latest front-end technologies.",
  "about": "Acceron is a professional and reliable software development, web designing, digital marketing, mobile app development company based in Thane, Mumbai, India. We specialize in providing solutions that help businesses of all sizes to build, optimize, and grow their online presence, products, and services.",
  "Link": "https://www.linkedin.com/company/acceron/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "66992e116864017cd43da57d"
  },
  "companyname": "Truelancer.com",
  "Type": "App Development",
  "Location": "Hybrid",
  "Responsibilities": "1. Developing Web & mobile applications using JavaScript (JS) Frameworks such as ReactJS.. Understanding of Cordova / PhoneGap, OOD & data structures. Knowledge of Ajax and integration with Web Services (REST) using JSON and XML.Knowledge of HTML5, CSS3 and new design patterns.Contributing in Architecture and Design of applications.Experience in writing high quality and optimized codecesses, as necessary.",
  "Qualifications": "Bachelor's Degree.3+ years of work experience with Java.3+ years of work experience with Microservices.",
  "about": "Truelancer is a Global Freelance Marketplace, Network of 600,000+ Freelance Professionals.Businesses can HIRE Freelancers/Contractors anytime to Scale their Business and get the work done quickly.One can also BUY listed Service Gigs on the platform to start the work quickly and save time.",
  "Link": "https://www.linkedin.com/company/truelancer/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "66992f3a6864017cd43da57e"
  },
  "companyname": "Eventat.com",
  "Type": "App Development",
  "Location": "Remote",
  "Responsibilities": "Design, develop, and maintain scalable and efficient full-stack applications using Django. Develop dynamic and responsive front-end interfaces with Angular and Ionic, ensuring a seamless user experience across all devices.Collaborate with cross-functional teams to define, design, and ship new features.Implement security and data protection measures. Integrate data storage solutions, including databases, key-value stores, blob stores, etc.Perform code reviews and enhance application performance.Troubleshoot, debug, and upgrade existing systems.Stay abreast of emerging technologies and propose ways to incorporate them into current and future projects.",
  "Qualifications": "- Minimum of 2 years of experience as a Full-Stack Developer.Strong knowledge of web frameworks (Python) such as Django.Proficiency in front-end frameworks like Angular and Ionic.Solid understanding of HTML5, CSS3, and JavaScript.Experience with database technology such as SQL, PostgreSQL, or MongoDB.Familiarity with version control tools like Git and platforms like GitHub.Excellent problem-solving skills and attention to detail.Ability to work independently and in a team environment.Strong verbal and written communication skills.",
  "about": "We believe technology has become an essential element of the modern age. Tech solutions, like mobile apps and online platforms, are now integrated within all fields, and thanks to them, our everyday lives are now less complex and more efficient.Kuwait has a unique social aspect; events, shows, and intellectual forums are held all year-round. These events witness tremendous participation of people from all parts of the country. Throughout the past years, we organized a great number of events and shows, and we noticed something missing. The traditional process of buying tickets and admitting attendees was always unorganized, resulted in long lines, and almost always ended with late admitting. Customers were unhappy.",
  "Link": "https://www.linkedin.com/company/eventat-com/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "66992fc36864017cd43da57f"
  },
  "companyname": "kquesto",
  "Type": "App Development",
  "Location": "Remote",
  "Responsibilities": "Develop and maintain high-performance mobile applications using React Native.Work on native Android development to enhance the app's functionality and performance.Design, develop, and maintain backend services and APIs.Collaborate with cross-functional teams to define, design, and ship new features.Integrate APIs and other third-party services.Implement real-time functionalities using WebSocket/WebRTC.Optimize applications for maximum speed, scalability, and responsiveness.Conduct code reviews and ensure code quality and best practices.",
  "Qualifications": "Proven experience in developing mobile applications with React Native.Strong proficiency in native Android development.Advanced knowledge of backend development with Node.js and JavaScript.Experience with cloud computing (preferably AWS).Experience with NoSQL databases (e.g., DynamoDB).Expertise in state management with Redux.Proficient in implementing WebSocket and WebRTC.Familiarity with Redis.Strong problem-solving skills and ability to work in a fast-paced environment.Excellent communication and teamwork skills.Contribution to open-source projects or personal repositories showcasing your work.",
  "about": "Kquesto is an educational and mentorship-oriented online service that operates via websites .The platform is primarily used for, educational purposes, professional networking, and career development, and allows aspirants preparing for competitive exams to connect to students already cleared Competitive exams. Kquesto helps in seeking guidance related to counseling of colleges or doubts related to their academics during their preparation which generally comes to aspirant minds and can only be cleared by the person who has faced the same during his time, Aspirants can post their Doubts in Community which will be answered by the experienced people in that field",
  "Link": "https://www.linkedin.com/company/kquesto/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "6699306b6864017cd43da580"
  },
  "companyname": "Gigsgen Digital Innovations",
  "Type": "App Development",
  "Location": "Remote",
  "Responsibilities": "This is a contract, remote Software Development Freelancer role. The successful candidates will be responsible for developing, testing, and implementing unique software solutions for our clients. They will work closely with cross-functional teams to ensure the successful delivery of high-quality software that meets client expectations. They must be able to problem solve, think creatively, and be self-motivated whilst also being able to work collaboratively with our other freelancers.",
  "Qualifications": "Experience in full software development lifecycle using software engineering principles of analysis, design, testing, and programming. Experience with programming languages such as Python, Java, C#, and JavaScript as well as an understanding of platform concepts and technologies, including frameworks and databases.Capable of understanding complex concepts and able to work successfully in a customer-facing environment, on large and highly visible development projects requiring creativity and strong capability in problem solving, coding, testing, and debugging.Ability to work effectively and efficiently with multiple programming languages to build various types of solutions and also work cross-functionally within collaborative teams to troubleshoot and solve business issues.Bachelor's degree in Computer Science, Computer Engineering or equivalent practical experience in software development.Fluent in English language (written and verbal).",
  "about": "Gigsgen is The premier freelance marketplace that specializes in Business Process Automation, Robotics Process Automation, and AI-Based Automation. We are dedicated to providing exceptional freelancing services across a wide range of domains to help businesses thrive in the digital age.This platform is designed to connect businesses with top-tier freelance talent who possess the expertise and experience to implement these transformative technologies. By partnering with our freelancers, you gain access to a global talent pool of professionals who excel in driving automation, delivering innovative solutions, and optimizing your business processes.",
  "Link": "https://www.linkedin.com/company/gigsgen-digital-innovations/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "669930de6864017cd43da581"
  },
  "companyname": "Ftechiz Solutions Pvt Ltd",
  "Type": "App Development",
  "Location": "Hybrid",
  "Responsibilities": "This is a contract, remote Software Development Freelancer role. The successful candidates will be responsible for developing, testing, and implementing unique software solutions for our clients. They will work closely with cross-functional teams to ensure the successful delivery of high-quality software that meets client expectations. They must be able to problem solve, think creatively, and be self-motivated whilst also being able to work collaboratively with our other freelancers.",
  "Qualifications": "In depth knowledge of React JS.Experience creating front end applications using HTML5, CSS, bootstrap.Hands on experience with JavaScript Development on both client and server-side.Ability to work both independently and in collaborative teams to communicate design and build ideas effectively.Able to handle multiple projects and competing deadlines.Good understanding of overall web design including basic usability, accessibility, industry standards, architecture, and navigation.Excellent communication and Client interaction.",
  "about": "At Ftechiz Solutions Pvt Ltd. we understand that the right talent can be a game changer for your business, our strategic approach of staff augmentation ensures that you get access to skills and expertise that your projects demand. We are renowned and trust worthy partners serving various start-ups and enterprises for the past 8 years by not only providing them with a team but also being their strategic partners.",
  "Link": "Ftechiz Solutions Pvt Ltd",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "669932066864017cd43da582"
  },
  "companyname": "CampCode",
  "Type": "App Development",
  "Location": "Hybrid",
  "Responsibilities": "Design, develop, and deploy backend solutions using server-side programming languages such as Nodejs.Collaborate with cross-functional teams to define and implement APIs and database solutions.Ensure the performance, scalability, and reliability of our backend systems",
  "Qualifications": "Proficiency in at least one server-side programming language, such as Nodejs.Familiarity with backend frameworks like Expressjs.Understanding of RESTful APIs and database management systems.Proficient in Payment integration for seamless transactions.Capable of implementing alerts through various channels to ensure effective communicationExperience with Firebase",
  "about": "At CampCode. we understand that the right talent can be a game changer for your business, our strategic approach of staff augmentation ensures that you get access to skills and expertise that your projects demand. We are renowned and trust worthy partners serving various start-ups and enterprises for the past 8 years by not only providing them with a team but also being their strategic partners.",
  "Link": "https://www.linkedin.com/company/campcodes/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "6699328a6864017cd43da583"
  },
  "companyname": "GVR BUSINESS TRANSFORMS",
  "Type": "App Development",
  "Location": "Hybrid",
  "Responsibilities": "Develop, test, and maintain web applications using MERN stack technologies.Collaborate with team members and stakeholders to understand project requirements and deliverables.Ensure applications are scalable, secure, and performant.Implement best practices in software development, including code reviews, unit testing, and version control.Troubleshoot and debug issues that arise during development or in production.Assist in conducting training sessions for junior developers or internal teams.Document processes and development workflows for reference and training purposes.",
  "Qualifications": "Bachelor's degree in Computer Science, Engineering, or a related field (or equivalent practical experience).Strong proficiency in MongoDB, MySQL, and the MERN stack (MongoDB, Expressjs, Reactjs, Nodejs).Experience with AWS services, particularly EC2, for deployment and hosting.Demonstrated experience in independently managing projects from start to finish.Familiarity with SDLC principles and agile methodologies.Ability to communicate effectively in Malayalam, Tamil, English, Hindi, Kannada, Telugu, and preferably another regional language.Excellent problem-solving skills and attention to detail.Ability to work effectively both independently and as part of a team.Immediate availability to join the team would be an advantage.",
  "about": "At GVR BUSINESS TRANSFORMS. we understand that the right talent can be a game changer for your business, our strategic approach of staff augmentation ensures that you get access to skills and expertise that your projects demand. We are renowned and trust worthy partners serving various start-ups and enterprises for the past 8 years by not only providing them with a team but also being their strategic partners.",
  "Link": "https://www.linkedin.com/company/gvr-business-transforms/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "669933a56864017cd43da585"
  },
  "companyname": "Finixia Dedecons pvt. Ltd.",
  "Type": "App Development",
  "Location": "Remote",
  "Responsibilities": "Collaborate: Work closely with our experienced team of app developers to understand project requirements and contribute to the overall development process.Coding.Write clean and efficient code for mobile applications, ensuring functionality, performance, and user experience meet industry standards Testing: Assist in the testing and debugging of applications to identify and resolve any issues or bugs.Learning. Stay updated on the latest industry trends, technologies, and best practices in mobile app development.Documentation. Create and maintain comprehensive documentation for developed applications, ensuring seamless knowledge transfer within the team..Innovation Bring fresh ideas and perspectives to the team, contributing to the innovation and improvement of our app development processes.",
  "Qualifications": "Currently pursuing or recently graduated with a degree in Computer Science, Software Engineering, or a related field.Basic understanding of mobile app development concepts and frameworks.Familiarity with programming languages such as Java, Kotlin, Swift, or Flutter.Strong problem-solving skills and a passion for learning new technologies.Good communication skills and ability to work collaboratively in a team environment.",
  "about": " We're a specialized IT company offering Web Dev, App Dev, Digital Mktg, and Graphic Design services. 💻📱📈🎨 #webdev #appdev #digitalmktg #graphicdesignYou will also be assigned to a dedicated Talent Success Coach during the engagement.(Note: There are many more opportunities apart from this on the portal. Depending on the assessments you clear, you can apply for them as well)..",
  "Link": "https://www.linkedin.com/company/finixiadedecons/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "6699342a6864017cd43da586"
  },
  "companyname": "Sparkmetrics Solutions.",
  "Type": "App Development",
  "Location": "Remote",
  "Responsibilities": "Writing effective and scalable Python codes.Designing and implementing robust applications.Debugging applications to ensure low latency and high-availabilit.Integrating user-facing elements with server-side logic Implementing security and data protection.Accommodating various data storage solutions.Analysing and customizing the source code as per business requirements.Integrating and developing code with a version control tool (we use Git and GitHub)",
  "Qualifications": "Should have master s degree BCA, MCA, MCS, BE, ME Basic Understanding of Object Oriented Programming.Knowledge of Django, Flask or similar Python frameworks Familiarity with the libraries like pandas, geopandas, GDAL/OGR, numpy, etc.Familiarity with front-end technologies, such as JavaScript, HTML5, and CSS3.Knowledge of Relational Databases & SQL concepts",
  "about": " we are well established company since 2013. At Sparkmetrics Solutions, we are passionate about using technology to solve business problems. Whether you need an enterprise software solution, a custom web application, a digital marketing campaign, an eCommerce platform, or a game development project, our team of experts is here to help you. We pride ourselves on delivering high-quality work on time and on budget. Let us help you take your business to the next level.",
  "Link": "https://www.linkedin.com/company/sparkmetricssolutions/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "669934766864017cd43da587"
  },
  "companyname": "KarmaCircles",
  "Type": "App Development",
  "Location": "Remote",
  "Responsibilities": "Developing and implementing user-friendly interfaces for websites and applications.Collaborating with cross-functional teams to gather and analyze requirements.Testing and debugging web applications to ensure optimal performance.Participating in the design and development of responsive web designs.",
  "Qualifications": "A graduation degree is mandatory.Excellent written and verbal communication skills.A quick learner who is adaptable to changing business needs.The ability to multitask effectively.",
  "about": "KarmaCircles is all about mentorship given away in small time blocks and sealed with public thank-you notes. You can build your online reputation around your expertise, and also ask other KarmaGivers for advice in the areas you’d like to grow. We want everyone to be a giver and receiver of mentorship on KarmaCircles, and we make it extremely easy for you to give and receive free advice.",
  "Link": "https://www.linkedin.com/company/karmacircles/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "669949cbedfb8fa086038505"
  },
  "companyname": "CodersBrain",
  "Type": "UI/UX ARCHITECT",
  "Location": "OnSite",
  "Responsibilities": "CANDITATE MUST HAVE 10+YEARS OF EXPERIENCE AND REACTJS SKILL IS MANDTORAY.HE/SHE MUST HAVE GOOD KNOWLEDGE IN THERE SKILLS. AND MUST HAVE GOOD COMMUNICATION SKILLS.CANDITATE NEED TO WORK FOR LOCATION NO REMOTE OPTION IS THERE.",
  "Qualifications": "A graduation degree is mandatory.Excellent written and verbal communication skills.A quick learner who is adaptable to changing business needs.The ability to multitask effectively.",
  "about": "Coders Brain is a global leader in its services, digital, and business solutions that partners with its clients to simplify, strengthen, and transform their businesses. We ensure the highest levels of certainty and satisfaction through a deep-set commitment to our clients, comprehensive industry expertise, and a global network of innovation and delivery centers.",
  "Link": "https://www.linkedin.com/company/codersbrain/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "66994a21edfb8fa086038506"
  },
  "companyname": "CodeMyMobile",
  "Type": "UI/UX ARCHITECT",
  "Location": "OnSite",
  "Responsibilities": "Conducts user research, usability testing, and analysis to inform design decisions and validate design solutions.Creates wireframes, interactive prototypes, and design mockups, ensuring usability and alignment with user-centered design principles.Designs visually appealing interfaces, applying principles of visual hierarchy, typography, and color to create intuitive and engaging user experiences.Collaborates closely with product managers, developers, and other stakeholders to ensure design solutions meet project requirements and technical constraints.",
  "Qualifications": "A graduation degree is mandatory.Excellent written and verbal communication skills.A quick learner who is adaptable to changing business needs.The ability to multitask effectively.",
  "about": "CodeMyMobile is a closely-knit team of product engineers, designers, and brand strategists. Together, we craft visually stunning websites, user-friendly apps, and extraordinary digital experiences that captivate our clients and their customers. With more than ten years of industry experience, we have honed our skills in building customer-centric tech teams that seamlessly evolve from delivering minimum viable products to handling complex, large-scale projects. Our expertise lies in creating exceptional digital solutions that prioritize user satisfaction.",
  "Link": "https://www.linkedin.com/company/codemymobile/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "66994acfedfb8fa086038507"
  },
  "companyname": "Immensetek",
  "Type": "UI/UX ARCHITECT",
  "Location": "Remote",
  "Responsibilities": "Lead the design process for web and mobile applications, from wireframes and prototypes to final visual designs.Collaborate with product managers, engineers, and other stakeholders to define project requirements and deliverables.Conduct user research and usability testing to gather insights and validate design decisions.Create high-fidelity mockups and interactive prototypes.using industry-standard tools such as Sketch, Figma, or Adobe XD.Ensure designs are accessible, responsive, and optimized for performance across various devices and platforms.Stay up-to-date with the latest design trends, tools, and best practices, and share knowledge with the team.",
  "Qualifications": "Bachelor's degree in Design, HCI, or related field.4+ years of experience in UI/UX design, with a strong portfolio showcasing your work.Proficiency in design tools such as Sketch, Figma, Adobe XD, Photoshop, and Illustrator.Experience working in an agile development environment and collaborating with cross-functional teams.Strong understanding of user-centered design principles and best practices.",
  "about": "CodeMyMobile is a closely-knit team of product engineers, designers, and brand strategists. Together, we craft visually stunning websites, user-friendly apps, and extraordinary digital experiences that captivate our clients and their customers. With more than ten years of industry experience, we have honed our skills in building customer-centric tech teams that seamlessly evolve from delivering minimum viable products to handling complex, large-scale projects. Our expertise lies in creating exceptional digital solutions that prioritize user satisfaction.",
  "Link": "https://www.linkedin.com/company/immensetek/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "66994b2fedfb8fa086038508"
  },
  "companyname": "True Tech Professionals",
  "Type": "UI/UX ARCHITECT",
  "Location": "OnSite",
  "Responsibilities": "Ideate innovative design solutions and initiatives that enhance user experience and drive.engagement, conversion, and retention.Lead the design process from concept to execution, including user research, wireframing,prototyping, and user testing.Drive the execution of key design projects and initiatives, overseeing all aspects of design.development and implementation.Provide strategic guidance and leadership to the design team, fostering a culture of innovation.collaboration, and excellence.Act as a liaison between the design team and other departments, ensuring effective.communication and alignment of design prioritie",
  "Qualifications": "Bachelor's degree in Design, HCI, or related field.4+ years of experience in UI/UX design, with a strong portfolio showcasing your work.Proficiency in design tools such as Sketch, Figma, Adobe XD, Photoshop, and Illustrator.Experience working in an agile development environment and collaborating with cross-functional teams.Strong understanding of user-centered design principles and best practices.",
  "about": "Welcome to True Tech Professionals, a distinguished technology company committed to orchestrating pragmatic and pertinent digital transformations for businesses through cost-effective software solutions. Our paramount mission is to harness the forefront of technologies, presenting our esteemed customers with an unparalleled user experience that encompasses speed, advanced features, comprehensive reports, analytics, artificial intelligence, machine learning, predictive analysis, and emerging trends..",
  "Link": "https://www.linkedin.com/company/truetechpro/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "66994b9cedfb8fa086038509"
  },
  "companyname": "Axzora Resourcing",
  "Type": "UI/UX ARCHITECT",
  "Location": "OnSite",
  "Responsibilities": "Collaborate with product managers, developers, and other stakeholders to gather requirements and define project goals.Create wireframes, user flows, and prototypes to visualize design concepts and interactions.Design intuitive and visually appealing user interfaces for web and mobile applications using tools such as Adobe XD, Sketch, and Figma.Conduct user research, usability testing, and analysis to validate design decisions and improve the overall user experience.Translate complex requirements into simple and elegant design solutions that align with brand guidelines and design principles.Iterate on designs based on feedback, user testing results, and emerging design trends.Work closely with developers to ensure the feasibility and implementation of design solutions.Collaborate with graphic designers to create visual assets and graphics for digital products.",
  "Qualifications": "Bachelor's degree in Design, Human-Computer Interaction, or related field.Proven experience as a UI/UX Designer with a strong portfolio showcasing your design work and process.Proficiency in design tools such as Adobe XD, Sketch, Figma, and wireframing tools.Solid understanding of user-centered design principles and methodologies.Experience with user research, usability testing, and prototyping.Strong communication and collaboration skills, with the ability to effectively communicate design ideas and rationale.Creativity and attention to detail, with a focus on delivering polished and user-friendly designs.Ability to work independently and manage multiple projects simultaneously.Knowledge of graphic design principles and experience creating visual assets is a plus.Experience with HTML, CSS, and front-end development is a plus but not required..",
  "about": "Axzora® Resourcing is a leading contingent staffing firm that excels in providing customized staffing solutions for organizations of all sizes and across various industries. Our mission is to identify top-tier talent for long-term success, ensuring seamless placements and satisfaction for both clients and candidates..",
  "Link": "https://www.linkedin.com/company/axzora-resourcing/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "66994c5aedfb8fa08603850a"
  },
  "companyname": "Zigsaw",
  "Type": "UI/UX ARCHITECT",
  "Location": "OnSite",
  "Responsibilities": "Gathering user requirements, designing graphic elements, and building navigation components.To be successful in this role, you should have experience with designing websites and wireframetools.Please share your portfolio of professional design projects that includes work with web/mobile applications..",
  "Qualifications": "Must have 5+ years proven UI experience.Demonstrable UI design skills with a strong portfolio.Solid experience in creating wireframes, storyboards, user flows, process flows and site maps.Develop UI mock-ups and prototypes that clearly illustrate how sites function and look like.Proficiency in Photoshop, Illustrator, Figma, Adobe XD, SketchUp or other visual design and wire-framing tools.Excellent visual design skills with sensitivity to user-system interaction.Ability to present your designs and sell your solutions to various stakeholders.Ability to solve problems creatively and effectively..",
  "about": "Zigsaw is an HR technology company that is one of the fastest growing recruitment firms of India. Zigsaw collaborates with companies to help fulfill their hiring requirements in the least possible time & in the best possible way. It delivers the most comprehensive and end-to-end solutions for hiring the “best-fit” talent. Currently operational in all the major cities of India with its stronghold in tier-2 &tier-3 cities, Zigsaw also boasts of its international clientele. Most recruitments at Zigsaw happen through Social Media and our customisable plans fit both, the startups and the corporate",
  "Link": "https://www.linkedin.com/company/zigsaw-consultancy-services/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "66994cf1edfb8fa08603850b"
  },
  "companyname": "CloudHire",
  "Type": "UI/UX ARCHITECT",
  "Location": "Remote",
  "Responsibilities": "Conceptualize and design user-centric interfaces that provide a seamless and visually appealing user experience.Work closely with product managers and developers to understand project requirements and user needs.Expertise in using Figma for designing and prototyping.Collaborate with cross-functional teams and share design assets using Figma for seamless workflows.Stay updated on design trends and ensure the integration of modern UI aesthetics into our products.Create designs that reflect a fresh and contemporary look while aligning with the brand identity.Provide detailed design specifications and guidelines to ensure accurate implementation on the front end.",
  "Qualifications": "Bachelor's degree in Graphic Design, UI/UX Design, or related field.Proven 5-7 years of experience as a UI/UX Designer with a strong portfolio showcasing modern and innovative designs.Proficient in Figma or similar design and prototyping tools.Solid understanding of front-end development and the ability to communicate design specifications effectively to developers.Knowledge of fluid design principles and creating visually engaging user interfaces.Familiarity with design systems and their implementation.Shift Timing: 5:30 PM to 3:00 AM ( 4-5 hrs of overlapping required )",
  "about": "CloudHire is a leading remote employee provider that sources top global talent for businesses of all sizes. We are committed to finding the best candidates who align with our clients' mission and values. Our inclusive and flexible work environment allows our team members to achieve a healthy work-life balance and excel in their roles.",
  "Link": "https://www.linkedin.com/company/cloudhire1/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "66994d59edfb8fa08603850c"
  },
  "companyname": "CRM Talent",
  "Type": "UI/UX ARCHITECT",
  "Location": "Remote",
  "Responsibilities": "Conduct user research to understand user needs and pain points.Develop user personas and journey maps.Create wireframes, prototypes, and mockups.Design user interfaces (UI) that are both appealing and functional.Ensure UI consistency across all platforms.Collaborate with engineers and product managers to bring designs to life.Stay up-to-date on the latest UI/UX trends and best practices",
  "Qualifications": "3-6 years of experience in UI/UX design.Proven track record of designing and implementing user-centered experiences.Strong understanding of user research. .Experience working with Elementor. ",
  "about": "Are you passionate about creating intuitive and user-friendly experiences? Do you thrive in a collaborative environment and have a strong eye for design? If so, we want to hear from you! We're looking for a talented UI/UX WordPress Developer to join our growing team and play a key role in shaping the future of our products. In this role, you'll be responsible for the entire design process, from user research and wireframing to prototyping and visual design, as well as developing and maintaining WordPress websites..",
  "Link": "https://www.linkedin.com/company/crm-talent/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "66994ddbedfb8fa08603850d"
  },
  "companyname": "Blockly Technologies",
  "Type": "UI/UX ARCHITECT",
  "Location": "Remote",
  "Responsibilities": "Collaborate with cross-functional teams to understand business and user requirements.Design and develop user interface designs for mobile applications.Create wireframes, prototypes, and mockups to effectively communicate design ideas.Implement responsive design principles to ensure seamless user experience across various devices.Optimize application for maximum speed and scalability.Stay updated with industry trends and best practices in UI/UX design.Collaborate with developers to ensure implementation aligns with design specifications.Coordinate with product managers to align design solutions with business objectives",
  "Qualifications": "Bachelor's degree in Computer Science, Design, or a related field.Proven work experience as a UI/UX Designer or similar role.Demonstrable UI/UX design skills with a strong portfolio.Familiar with HTML, CSS, and JavaScript .Experience using design tools such as Adobe XD, Sketch, or Figma.Understanding of design principles and best practices.Knowledge of user-centered design processes and methodologies.Ability to work effectively in a collaborative environment.Excellent communication and interpersonal skills ",
  "about": "n today's dynamic world, ensuring the safety and security of our loved ones is a top priority. At Blockly Technologies, we're dedicated to simplifying safety monitoring with innovative solutions designed to provide peace of mind for families and institutions.Our flagship products, Reaching and SchoolBus2.0, leverage cutting-edge technology to offer real-time route sharing and AI-powered school bus tracking. These solutions empower users with seamless monitoring capabilities, ensuring timely updates and reliable communication..",
  "Link": "https://www.linkedin.com/company/blockly-technologies-private-limited/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "66994e68edfb8fa08603850e"
  },
  "companyname": "Vrinda Global",
  "Type": "UI/UX ARCHITECT",
  "Location": "Remote",
  "Responsibilities": "Design and implement user interfaces for our cutting-edge web applications using JavaScript, React, and Nextjs.Collaborate with product managers, designers, and engineers to create seamless user experiences.Translate user requirements into interactive designs and functional applications.Optimize applications for performance, scalability, and maintainability.Conduct code reviews and ensure adherence to best practices.Stay updated with the latest UI/UX trends, techniques, and technologies.",
  "Qualifications": "Bachelor's degree in Computer Science, Engineering, or a related field.3+ years of professional experience in UI/UX engineering.Proficient in JavaScript, React, and Next.js.Proven experience working with top-tier Indian companies.Strong understanding of web development principles and best practices.Excellent problem-solving abilities and attention to detail.Strong communication and teamwork skills. ",
  "about": "Vrinda is a Talent Sourcing Company.Incorporated in 2006, this entrepreneurial journey has metamorphosed to a transnational organisation business operations in Asia, Europe & US.With a meticulous focus on driving successful hires, we’re a new type of partner and a new type of recruiting system. Our systematic, process driven approach to recruitment ensures engagement with the right talent and a superior candidate experience.",
  "Link": "https://www.linkedin.com/company/vrinda-consultants/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "66994efbedfb8fa08603850f"
  },
  "companyname": "AccuKnox",
  "Type": "Software Tester",
  "Location": "Remote",
  "Responsibilities": "Develop Client Relationships with Top 1000 companies in India (established companies and unicorns).Articulate AccuKnox Cloud Security value proposition.Work with SDR (Sales Development Resources) to generate qualified leads.Qualify opportunities using the BANT (Budget, Authority, Need, Timing) criteria and https://meddicc.com/ sales methodology.Work with Solution Engineers to coordinate Demos, RFP responses POC (Proof of Concepts).Update Salesforce CRM on a meticulous, weekly basis",
  "Qualifications": "Disciplined Enterprise / B2B sales experience (2-5 years).Experience in Cloud, CyberSecurity Product Sales.Strong English written and verbal communication skills.Email marketing, LinkedIn marketing; Zoom, Google Video; Microsoft Teams experience.BE/BTech in Computer Science and MBA Preferred ",
  "about": "AccuKnox is a Gen-AI Powered Zero Trust CNAPP. Launched in 2020 in co-partnership with Stanford Research Institute (www.sri.com) and is anchored on seminal patented inventions in the areas of Container Security, Anomaly Detection, and Data Provenance.AccuKnox can be deployed in Public and Private Cloud environments. AccuKnox has received seed funding from SRI, National Grid Ventures, z5Capital, and Outliers.vc",
  "Link": "https://www.linkedin.com/company/accuknox/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "66994f77edfb8fa086038510"
  },
  "companyname": "Cyberr",
  "Type": "Software Tester",
  "Location": "Remote",
  "Responsibilities": "Monitor security alerts and events from various sources, including security information and event management (SIEM) systems.Investigate and respond to security incidents promptly and effectively.Conduct thorough analysis of security events and incidents to identify potential threats and vulnerabilities.Utilize advanced threat intelligence to proactively identify and mitigate potential security risks.Stay informed about the latest security threats, vulnerabilities, and industry best practices.Develop and implement detection rules and signatures to enhance threat detection capabilities.",
  "Qualifications": "Bachelor's degree in Information Security, Cybersecurity, Computer Science, or a related field.Proven experience as a SOC Analyst or in a similar cybersecurity role.In-depth knowledge of cybersecurity principles, technologies, and best practices.Hands-on experience with SIEM tools, intrusion detection systems, and other security technologies.Certifications such as CISSP, CompTIA Security+, or GIAC are highly desirable.Strong analytical and problem-solving skills.",
  "about": "At Cyberr, our mission is to establish a groundbreaking global platform that embraces every individual in the cybersecurity domain, from enthusiastic graduates to the utmost experts.We are committed to fostering a nurturing environment where seasoned professionals mentor and endorse newcomers, helping them integrate seamlessly into the cybersecurity ecosystem.",
  "Link": "https://www.linkedin.com/company/cyberrplatform/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "66994fbfedfb8fa086038511"
  },
  "companyname": "Tekgence Inc",
  "Type": "Software Tester",
  "Location": "Remote",
  "Responsibilities": " Work as part of the global Network Security team – works alongside the WAF team.Experience with Akamai or similar platforms e.g radware, Kona site defender etc.Experience in onboarding web services into WAF (Akamai) platforms in monitoring / transparent mode (SME).Transitioning WAF from transparent to enforcement mode (SME).Web network security / WAF SME with the ability to be hands-on.Finding vulnerabilities in WAF logs.",
  "Qualifications": "Bachelor's degree in Information Security, Cybersecurity, Computer Science, or a related field.Proven experience as a SOC Analyst or in a similar cybersecurity role.In-depth knowledge of cybersecurity principles, technologies, and best practices.Hands-on experience with SIEM tools, intrusion detection systems, and other security technologies.Certifications such as CISSP, CompTIA Security+, or GIAC are highly desirable.Strong analytical and problem-solving skills.",
  "about": "We accelerate business transformation by solving complex technology, business and talent challenges. A digital transformation Partner and Global consulting firm transforming clients business, operating and technology models for the digital era. Strong experience to support the industry providing change management and business process improvement services with a specialist knowledge in Procurement, Supply Chain and Logistics.",
  "Link": "https://www.linkedin.com/company/tekgence-inc/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "66995002edfb8fa086038512"
  },
  "companyname": "Understanding Recruitment",
  "Type": "Software Tester",
  "Location": "Remote",
  "Responsibilities": "Experience across infrastructure, information and application security.Ability to conduct threat modelling and risk assessment.Infrastructure/DevSecOps tech knowledge, including experience working in production cloud and container environments.Exposure to trading, finance, fintech or wider Web3 environments where security is paramount",
  "Qualifications": "Bachelor's degree in Information Security, Cybersecurity, Computer Science, or a related field.Proven experience as a SOC Analyst or in a similar cybersecurity role.In-depth knowledge of cybersecurity principles, technologies, and best practices.Hands-on experience with SIEM tools, intrusion detection systems, and other security technologies.Certifications such as CISSP, CompTIA Security+, or GIAC are highly desirable.Strong analytical and problem-solving skills.",
  "about": "Understanding Recruitment is the go-to destination for technology recruitment with headquarters in St. Albans, England. Specialising in Biotechnology, Artificial Intelligence, and Web3, our team of over 90 recruiters is adept in navigating the dynamic landscapes of Blockchain & Cryptocurrency, Java, JavaScript, Python, Rust, Golang, .NET, DevOps, Product Management, and other tech roles within the Software Development Lifecycle. As your total talent solution partner, we seamlessly connect organisations with top-tier talent and empower tech professionals to discover their perfect fit within the ever-evolving tech industry. We offer unparalleled matches and comprehensive support across the UK, Europe, and the USA.",
  "Link": "https://www.linkedin.com/company/understanding-recruitment/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "66995016edfb8fa086038513"
  },
  "companyname": "Scrut Automation",
  "Type": "Software Tester",
  "Location": "Remote",
  "Responsibilities": "Build enterprise security control strategies, setting a security posture, and leading the implementation; across all stages of prevention, detection, and response.Apply a software-development based approach with automation as a core part of our enterprise security controls.Perform threat models, implementation reviews, and security testing; review requirements and designs.Embed yourself into technology and business teams, acting as a security player-coach.Monitor and analyze production security events and, as needed, provide in-depth incident analysis.Build relationships with other engineers, product managers, data engineers, operators, and business team members.Empathize as you reduce risk while focusing on a great employee and user experience.",
  "Qualifications": "Multiple years of experience in technology / cyber security.An ability to identify and provide a basic assessment of security threats.An understanding of security problems, paired with an ability to suggest solutions to technology design problems.Ability to automate tasks using software or scripting in combination with other technologies (ex: Lambda/GCP Functions/Azure Functions).Cloud and SaaS experience.Ability to mentor others on technical topics, including security.",
  "about": "Scrut Automation is an information security and compliance monitoring platform, aimed at helping small and medium cloud-native enterprises develop and maintain a robust security posture, and comply with various infosec standards such as SOC 2, ISO 27001, GDPR, and the like with ease. With the help of the Scrut platform, customers reduce their manual effort for security and compliance tasks by 70%, and build real-time visibility of their security posture..",
  "Link": "https://www.linkedin.com/company/scrut-automation/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "6699513fedfb8fa086038514"
  },
  "companyname": "Manpower Recruitment Agency India",
  "Type": "Software Tester",
  "Location": "Hybrid",
  "Responsibilities": " Knowledge in Cyber security frameworks, controls, technology and solutions.Monitor firewall and other relevant security logs to review for threats anomalies, intrusions and abnormal connection behavior. Investigates reports and escalates issues as required to Cyber security staff and management.Configures and test security relates technologies troubleshoot and corrects security data related problems.Perform hardware and software u[grades and documents configurations and system specifications.Executing Cyber security strategies and solutions.Interfacing with internal and external parties regarding security policy standard violations, security controls failures and incident response situations.Performing PM & CM for DCS, SIS, ICS Cyber security assets.Manage system patches anti-virus updates and perform ICS assets patches and back ups.Collecting ICS Field Assets Data collection for all DCS & NOC -DCS system assets related to projects",
  "Qualifications": "Associate's Degree in Computer Information Systems or related discipline.Two year work experience in Cyber securityMinimum of 3-5 years in the field of OT Cyber security Operation.Aware of the applicable standard for IEC 62443.CCNA Certification.MCSA Certification.A+C+ Sec+ Certification.CAP & EPO Certification..",
  "about": "Manpower Recruitment Agency India is an information security and compliance monitoring platform, aimed at helping small and medium cloud-native enterprises develop and maintain a robust security posture, and comply with various infosec standards such as SOC 2, ISO 27001, GDPR, and the like with ease. With the help of the Scrut platform, customers reduce their manual effort for security and compliance tasks by 70%, and build real-time visibility of their security posture..",
  "Link": "Manpower Recruitment Agency India",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "669951bfedfb8fa086038515"
  },
  "companyname": "FedTec",
  "Type": "Software Tester",
  "Location": "Hybrid",
  "Responsibilities": " Cybersecurity Program Delivery: Ensure the delivery of an enterprise-level cybersecurity program, maintaining high standards of security across all systems and platforms.Reference Architectures: Develop reference architectures to address commonrequirements or mitigate trends in security findings, following and identifying best practices.Threat Modeling: Lead threat modeling efforts and collaborate with technical delivery teams to integrate security requirements and practices into solutions.Architecture Reviews: Conduct security architecture reviews of platforms and applications in complex multi-tenant, multi-provider, and vendor-cloud environments.Strategic Roadmaps: Deliver strategic roadmaps, researching and investigating new methods for delivering security as code, and automating existing security architecture assessments and processes.Strategic Platform Initiatives: Partner with IT teams to follow progress on strategic platform initiatives, manage oversight, and address critical issues that may pose risks.Assessment Management: Ensure assessments are well-documented,",
  "Qualifications": "Education: Bachelor's degree or equivalent experience in business, computer science, or management information systems.Experience: Minimum of 10 years of professional experience solving business problems with technology solutions, preferably at an energy facility or related industry.Security Certifications: Preferred industry-recognized experience in security (e.g., CISSP, CCSK, CISA, CISM, CEH).IT Security Risk Assessments: Minimum of 5 years of experience in IT security risk assessments and related frameworks (e.g., NIST 800 series, ISO 27000 series, IT General Controls).Technical Skills:Knowledge of Identity and Access Management (IAM), Cryptography / Key Management, Access Controls and Security Protocols, secrets modernization, and secrets management (e.g., Multi-factor, SAML, OAuth, OIDC).Strong knowledge of Azure/AWS Infrastructure services.Communication: Superior written and oral communication skills.Analytical Skills: Strong analytical and system design skills.Self-Motivation: Self-motivated and directed, with the ability to effectively prioritize and execute tasks in a high-pressure environment..",
  "about": "FedTec is a leading digital solutions, infrastructure services and cybersecurity provider for federal government agencies. We fuel agencies to meet the mission of tomorrow with innovative solutions and transformative insight.Powered by our expert technologists and mission architects, we unlock the true value of cutting-edge technologies to optimize operations. With 18 years of experience serving the government, we empower agencies to navigate complexity and stay ahead in an ever-evolving technology landscape..",
  "Link": "https://www.linkedin.com/company/fedtecllc/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "66995247edfb8fa086038516"
  },
  "companyname": "FedTec",
  "Type": "Software Tester",
  "Location": "Remote",
  "Responsibilities": "Monitor Security Events: Continuously monitor security alerts and events from various sources such as SIEM, IDS/IPS, firewalls, and antivirus systems.Incident Triage: Perform initial triage of security incidents, determine the severity and impact, and escalate to higher-level analysts as necessary.Threat Detection: Identify potential security threats and vulnerabilities by analyzing logs, network traffic, and other data.Incident Response: Execute standard operating procedures for incident response, including containment, eradication, and recovery actions.Documentation: Accurately document all incidents, their resolution, and lessons learned in incident management systems.Collaboration: Work closely with other SOC team members and IT staff to resolve security incidents and improve overall security posture.,",
  "Qualifications": "Education: Bachelor's degree in Cybersecurity, Information Technology, Computer Science, or a related field, or equivalent work experience. Experience: Entry-level position; 0-2 years of experience in cybersecurity or IT-related roles. Internships and relevant coursework are a plus. Certifications: Certifications such as CompTIA Security+, Certified Ethical Hacker (CEH), or other relevant certifications are advantageous. Skills:Basic understanding of cybersecurity principles and technologies. Familiarity with security information and event management (SIEM) tools. Knowledge of network protocols, intrusion detection/prevention systems (IDS/IPS), and firewalls. Strong analytical and problem-solving skills. Excellent written and verbal communication skills. Ability to work in a fast-paced environment and handle multiple tasks simultaneously. Attention to detail and a commitment to accuracy.",
  "about": "Groupon is an experiences marketplace that brings people more ways to get the most out of their city or wherever they may be. By enabling real-time mobile commerce across local businesses, live events and travel destinations, Groupon helps people find and discover experiences––big and small, new and familiar––that make for a full, fun and rewarding life. Groupon helps local businesses grow and strengthen customer relationships––resulting in strong, vibrant communities..",
  "Link": "https://www.linkedin.com/company/fedtecllc/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "669952beedfb8fa086038517"
  },
  "companyname": "Applicantz",
  "Type": "Software Tester",
  "Location": "Remote",
  "Responsibilities": "Develop capabilities of security tooling and configuration to better protect systems, improve organization and structure of security tools – especially Microsoft Defender, vulnerability management and remediation.Diagnose and fix issues with security tooling and configuration on Windows and MacOS – including performance issues, loss of functionality, creating exceptions.Analyze and report on vulnerability and hardening compliance.Document procedures and processes.Lead initiatives to develop and build security utilities and tools that will enable others to operate more efficiently and securely in cloud environments.Work across cloud, business systems, and product teams to enhance and evangelize security in infrastructure.Research emerging technologies and maintain awareness of current security risks in support of security enhancement and development efforts",
  "Qualifications": "Hands-on endpoint systems administration experience – Windows 10/11, MacOS and Windows Server.Proven ability to diagnose tough Windows and MacOS technical problems and find elegant solutions or workarounds.Experience with security management tools, including Microsoft Defender, vulnerability management, update management.Experience with enterprise systems management, such as Active Directory, Azure Active Directory, group policy, Intune and Jamf.5+ years of experience in the field of information security in the following areas: Windows and MacOS security, vulnerability management and remediation, securing system configuration, e.g., CIS benchmarks and hardening.Experience supporting security initiatives and projects by effectively communicating with stakeholders, tracking progress, and organizing processes.Advanced people skills to effectively promote ideas and collaboration at the various levels of the organizationExcellent analytical skills, organizational skills, ingenuity, and the ability to work as part of a team or autonomously",
  "about": "We help teams not stress over resignations. We always keep interview-ready candidates available for every role in any team so that a replacement can be hired immediately. With us, teams can focus on revenue/deliverables and not on maintaining the workforce...",
  "Link": "https://www.linkedin.com/company/applicantz-com/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "66995334edfb8fa086038518"
  },
  "companyname": "Quest Software",
  "Type": "Software Tester",
  "Location": "Remote",
  "Responsibilities": "Lead the design, implementation, and maintenance of cybersecurity solutions to protect digital assets, including networks, applications, databases, and cloud environments.Perform regular security assessments, vulnerability assessments, and penetration testing to identify and address potential weaknesses in our clients' systems and applications.Collaborate with internal teams and external partners to develop and enforce security policies, procedures, and standards that comply with relevant regulations and industry frameworks.Monitor and analyze security incidents, respond to security breaches, and lead incident response efforts to minimize the impact of security events.Applying knowledge of Internal Audit policy and procedures to perform analysis and evaluation to design, implement, test, and field secure systems, networks, and architectures.Developing, implementing, and enforcing information systems security policies, ensuring system security requirements are addressed during all phases of the acquisition and Information System (IS) lifecycle.",
  "Qualifications": "At least three (3) years of experience as an ISSE on programs and contracts of similar scope, type, and complexity.Familiarity with System Life Cycle Development (SDLC) methodologies, the 800 series of NIST Special Publications.Must possess practical knowledge of IT audits, full security assessment process.Must have familiarity with the use and operation of cybersecurity tools such as security scanners (Qualys). CIS Benchmarks and automated compliance checkers (STIG).Expert level familiarity with Microsoft Office Suite (Word, Excel, PowerPoint, Teams, Outlook, Visio, Project, etc.)Exceptional verbal and written communication skills, with the ability to collaborate across teams and organizations, including senior-level management.Must be able to explain complex cybersecurity concepts to individuals with varying levels of cyber experience.BS or BA in Computer Science, Information Assurance, Computer Engineering, or related discipline.Four years of relevant experience can be substituted for a degree.If the role is located in APJ region working the evening shift is a requirement.",
  "about": "Quest is an equal-opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations, and ordinances..",
  "Link": "https://www.linkedin.com/company/quest-software/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "66995446edfb8fa086038519"
  },
  "companyname": "MedTourEasy",
  "Type": "Data Analyst",
  "Location": "Remote",
  "Responsibilities": "Week 1 & 2: Training Modules – Candidates will be completing the learning modules assigned.Week 3: Live Project – Candidates will be working on the live project assigned to them by the company.Week 4: Project Report – Candidates will be preparing a project report and submit.",
  "Qualifications": "Bachelor’s degree or pursuing.Proficiency with computers, especially MS Office.High level of accountability and motivation.Strong Interpersonal, time and project management, presentation, leadership, and communication skills.Creativity and ability to delegate responsibilities.Receptiveness to feedback and adaptability.Willingness to meet deadlines.",
  "about": "MedTourEasy, a global healthcare company, provides you the informational resources needed to evaluate your global options. It helps you find the right healthcare solution based on specific health needs, affordable care while meeting the quality standards that you expect to have in healthcare. MedTourEasy improves access to healthcare for people everywhere. MedTourEasy provides analytical solutions to our partner healthcare providers globally..",
  "Link": "https://www.linkedin.com/company/medtoureasyy/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "66995474edfb8fa08603851a"
  },
  "companyname": "Accopixel Technologies",
  "Type": "Data Analyst",
  "Location": "Remote",
  "Responsibilities": "Week 1 & 2: Training Modules – Candidates will be completing the learning modules assigned.Week 3: Live Project – Candidates will be working on the live project assigned to them by the company.Week 4: Project Report – Candidates will be preparing a project report and submit.",
  "Qualifications": "Bachelor’s degree or pursuing.Proficiency with computers, especially MS Office.High level of accountability and motivation.Strong Interpersonal, time and project management, presentation, leadership, and communication skills.Creativity and ability to delegate responsibilities.Receptiveness to feedback and adaptability.Willingness to meet deadlines.",
  "about": "we are well established company since 2015. At Accopixel Technologies, we are passionate about using technology to solve business problems. Whether you need an enterprise software solution, a custom web application, a digital marketing campaign, an eCommerce platform, or a game development project, our team of experts is here to help you. We pride ourselves on delivering high-quality work on time and on budget. Let us help you take your business to the next level..",
  "Link": "https://www.linkedin.com/company/accopixel/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "669954c6edfb8fa08603851b"
  },
  "companyname": "System Soft Technologies",
  "Type": "Data Analyst",
  "Location": "Remote",
  "Responsibilities": "This role is responsible for collecting, cleaning, preprocessing, and analyzing large datasets to derive meaningful insights and actionable recommendations. The role creates clear and effective visual representations of data using charts, graphs, and dashboards to communicate findings to technical and non-technical audiences. By transforming raw data into actionable insights, the role empowers teams across the organization to work more efficiently and effectively.",
  "Qualifications": "Data mining, Database build.Web scrapes of competitors pricing.Lots of data pulls and build of excel pivot tables , etc.Need sharp excel.data analytical types that can pull and analyze lots of data",
  "about": "System Soft is an IT service management company. We solve IT challenges of your limited managed IT services, which can hinder you from accomplishing technology solutions goals. We act as an extension of your IT team, providing everything from project support to complete IT consulting to future-proof your infrastructure. We invest in innovative technology solutions and methods to enhance your business agility, value and competitiveness...",
  "Link": "https://www.linkedin.com/company/systemsofttech/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "66995535edfb8fa08603851c"
  },
  "companyname": "Internkaksha IT Solutions",
  "Type": "Data Analyst",
  "Location": "Remote",
  "Responsibilities": "Assist in collecting, cleaning, and preparing data for analysis.Develop and validate predictive models.Create data visualizations and reports.Support in sharing insights with stakeholders.Learn various data analysis tools and techniques.",
  "Qualifications": "Data mining, Database build.Web scrapes of competitors pricing.Lots of data pulls and build of excel pivot tables , etc.Need sharp excel.data analytical types that can pull and analyze lots of data",
  "about": "Intern Kaksha is dedicated to creating innovative IT solutions and offering IT-enabled services that not only meet but delight our customers worldwide. We're all about building relationships based on trust, values, and professionalism.With specialization in various industry sectors including Technology, Finance, Healthcare, Media, Manufacturing, and many more, we bring industry-specific software expertise to the table. Our core offerings encompass Data & Analytics, Automation AI, IoT Services, Web Designing, Web Application Development, Mobile Application Development, Software Development, Digital Marketing, Software Testing, Quality Assurance services, and more.",
  "Link": "https://www.linkedin.com/company/intern-kaksh/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "669955c3edfb8fa08603851d"
  },
  "companyname": "EssentiallySports",
  "Type": "Data Analyst",
  "Location": "Remote",
  "Responsibilities": "Owning all things data in ES.You’ll make the key data decisions and see them through to successful user engagementCollaborating with other teams to find useful business insights.Supporting other teams in setting up success metrics for particular.products/features.Working with both Web Analytics and Backend Data Analytics.Assisting in presenting demos and preparing materials for Leadership",
  "Qualifications": "Have proficiency in SQL.Data Exploration and Visualisation with tools like Tableau, MS Excel, Power BI, etc.0-2 years of experience with Python Data Analysis Packages (Pandas, NumPy, Matplotlib, Scikit-Learn) .Strong analytical skills with the ability to collect, organise, analyse, and disseminate significant amounts of information with attention to detail and accuracy.Adept at queries, report writing, and presenting findings.A strong business sense with the ability to transform ambiguous business and product issues into well-scoped, impactful analysis.Media domain experience would be an added advantage.A desire to work in a fast-paced environmentProactive communication",
  "about": "EssentiallySports is a multi-sport news website owned by Full Spectrum Services LLP that delivers the latest news, articles, features, and updates on global sports such as UFC, NBA, NFL, NASCAR, eSports, Tennis, Formula 1, Boxing, WWE and Golf. We are dedicated to covering the most significant moments in sport and deliver content to our audience from the fan’s perspective.",
  "Link": "https://www.linkedin.com/company/essentially-sports/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "66995627edfb8fa08603851e"
  },
  "companyname": "Unified Mentor",
  "Type": "Data Analyst",
  "Location": "OnSite",
  "Responsibilities": "As a Data Analyst Intern at Unified Mentor, you will have the opportunity to gain hands-on experience in data analysis and contribute to real-world projects. This internship is designed to provide valuable insights and skills in data analytics, enhancing your career prospects in this field.",
  "Qualifications": "Assist in collecting, cleaning, and analyzing data sets.Collaborate with the data analysis team to identify trends and patterns.Contribute to the development of data visualization dashboards and reports.Support in creating presentations to communicate findings to stakeholders.Learn and utilize various data analysis tools and techniques.",
  "about": "Unified Mentor is dedicated to providing students and recent graduates with practical experiences and professional growth opportunities. We're excited to offer an unpaid internship opportunity in the field of data analysis.",
  "Link": "https://www.linkedin.com/company/unifiedmentor/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "6699569fedfb8fa08603851f"
  },
  "companyname": "EbizOn",
  "Type": "Data Analyst",
  "Location": "OnSite",
  "Responsibilities": "Work closely with project managers to understand and maintain focus on their analytics needs, including critical metrics and KPIs, and deliver actionable insights to relevant decision-makers.Proactively analyze data to answer key questions for stakeholders or yourself, with an eye on what drives business performance, and investigate and communicate which areas need improvement inefficiency and productivity.Create and maintain rich interactive visualizations through data interpretation and analysis, with reporting components from multiple data sources.",
  "Qualifications": "1.5 or more years of experience as a data analyst.Proven Business Analytics skills, including mining, evaluation, and visualization using PowerBI.Technical writing experience in relevant areas, including queries, reports, and presentations.Strong SQL or Excel skills, with aptitude for learning other analytics tools.Freshers need not apply",
  "about": "EbizOn is dedicated to providing students and recent graduates with practical experiences and professional growth opportunities. We're excited to offer an unpaid internship opportunity in the field of data analysis.",
  "Link": "https://www.linkedin.com/company/ebizon/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "66995707edfb8fa086038520"
  },
  "companyname": "Prometrics Solutions",
  "Type": "Data Analyst",
  "Location": "Hybrid",
  "Responsibilities": "Work closely with project managers to understand and maintain focus on their analytics needs, including critical metrics and KPIs, and deliver actionable insights to relevant decision-makers.Proactively analyze data to answer key questions for stakeholders or yourself, with an eye on what drives business performance, and investigate and communicate which areas need improvement inefficiency and productivity.Create and maintain rich interactive visualizations through data interpretation and analysis, with reporting components from multiple data sources.",
  "Qualifications": "0-3months of analysis, spreadsheet modeling, and database reporting & analysis experience .Bachelors Degree in Finance or Accounting preferred .Understanding of accounting policies and has a good knowledge of how data works .Ability to effectively manage time and prioritize multiple projects in a fast-paced environment .Ability to work well independently and in groups .Proven problem solving and critical thinking skills .Excellent analytical skills with an attention to detail .Very strong knowledge of Microsoft Excel and PowerPoint",
  "about": "Prometrics Solutions is dedicated to providing students and recent graduates with practical experiences and professional growth opportunities. We're excited to offer an unpaid internship opportunity in the field of data analysis.",
  "Link": "https://www.linkedin.com/company/prometricssolutions/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "66995757edfb8fa086038521"
  },
  "companyname": "Soul AI",
  "Type": "Data Analyst",
  "Location": "Hybrid",
  "Responsibilities": "Work closely with project managers to understand and maintain focus on their analytics needs, including critical metrics and KPIs, and deliver actionable insights to relevant decision-makers.Proactively analyze data to answer key questions for stakeholders or yourself, with an eye on what drives business performance, and investigate and communicate which areas need improvement inefficiency and productivity.Create and maintain rich interactive visualizations through data interpretation and analysis, with reporting components from multiple data sources.",
  "Qualifications": "0-3months of analysis, spreadsheet modeling, and database reporting & analysis experience .Bachelors Degree in Finance or Accounting preferred .Understanding of accounting policies and has a good knowledge of how data works .Ability to effectively manage time and prioritize multiple projects in a fast-paced environment .Ability to work well independently and in groups .Proven problem solving and critical thinking skills .Excellent analytical skills with an attention to detail .Very strong knowledge of Microsoft Excel and PowerPoint",
  "about": "We are an Enterprise AI firm focusing on RLHF and Custom AI solutions. We are dual incorporated in the US and India (our India office is in Gachibowli, Hyderabad).We are led by an IIT-IIM founding team, and have a highly skilled talent pool. Think PhDs, Engineers, Artists.We value wellness. Happy Employees = High Quality Work :).Our startup DNA helps us execute at the speed of light.",
  "Link": "https://www.linkedin.com/company/soul-ai/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "669957ccedfb8fa086038522"
  },
  "companyname": "FxPros Advisors LLP",
  "Type": "Data Analyst",
  "Location": "Hybrid",
  "Responsibilities": "working directly with customers to evaluate theircurrent data situation and develop plan to help clean up their data leveraging RoutineAI. Functional areas of interaction could be in Sales, Marketing, SupplyChain, Finance, Procurement, HR and Manufacturing functions. Candidate should Be capable to quickly learning customer s processes and data architecture irrespective of the functional area of interaction and become the trusted guide for data cleansing activities. The Data Analyst is responsible for business requirements gathering, functional analysis, future state data design, data transformation template creation or adoption, validation rules creation and being an expert in RoutineAI",
  "Qualifications": "0-3months of analysis, spreadsheet modeling, and database reporting & analysis experience .Bachelors Degree in Finance or Accounting preferred .Understanding of accounting policies and has a good knowledge of how data works .Ability to effectively manage time and prioritize multiple projects in a fast-paced environment .Ability to work well independently and in groups .Proven problem solving and critical thinking skills .Excellent analytical skills with an attention to detail .Very strong knowledge of Microsoft Excel and PowerPoint",
  "about": "We are an Enterprise AI firm focusing on RLHF and Custom AI solutions. We are dual incorporated in the US and India (our India office is in Gachibowli, Hyderabad).We are led by an IIT-IIM founding team, and have a highly skilled talent pool. Think PhDs, Engineers, Artists.We value wellness. Happy Employees = High Quality Work :).Our startup DNA helps us execute at the speed of light.",
  "Link": "https://www.linkedin.com/company/fxpros/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "6699d789edfb8fa086038523"
  },
  "companyname": "Turing",
  "Type": "Machine Learning",
  "Location": "Remote",
  "Responsibilities": "Develop efficient Python solutions to address diverse problems.Apply business acumen and analytical skills to derive actionable insights from public databases.Articulate reasoning and logic clearly when writing code in platforms like Jupyter notebooks.Collaborate closely with researchers to exchange insights and ideas.Ensure thorough documentation for all developed code.Utilize data analysis expertise to respond to significant business inquiries using datasets from various sources including Kaggle, the UN, and the US government.",
  "Qualifications": "Open to applicants at all levels, from junior to seasoned industry professionals.Bachelor's degree in Engineering, Computer Science, or equivalent practical experience.Proficiency in Python programming language for coding and debugging.Ability to handleintermediate-level Python coding tasks and understand algorithmic concepts.Strong problem-solving skills, complemented by exceptional reasoning and mathematical abilities.Proficient in English with excellent communication skills for effective team collaboration.",
  "about": "Turing accelerates AGI advancement and deployment for leading AI, tech, and enterprise companies by improving LLM performance and building custom genAI applications. Trusted by industry leaders like OpenAI, Google, and Meta, we enhance cognitive capabilities in coding, reasoning, and problem-solving. With 1000+ companies accelerated and expertise across 40+ industries, Turing is your partner in AGI innovation. Learn more at turing.com..",
  "Link": "https://www.linkedin.com/company/turingcom/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "6699d7dfedfb8fa086038524"
  },
  "companyname": "Process Point Technologies Corporation",
  "Type": "Machine Learning",
  "Location": "Remote",
  "Responsibilities": "Assist in developing and implementing data science and machine learning solutions.Collaborate with cross-functional teams to identify and solve complex business problems.Preprocess, clean, and analyze structured datasets using Python libraries such as pandas or polars.Build, train, and optimize machine learning models using techniques such as regression, classification, clustering, and dimensionality reduction.Communicate findings and insights to technical and non-technical stakeholders.Continuously learn and stay updated with the latest trends and techniques in data science and machine learning..",
  "Qualifications": "Bachelor's or Master's degree in Computer Science, Statistics, Mathematics, or a related field (or currently pursuing).Strong proficiency in Python programming language.Solid understanding of data manipulation, exploratory data analysis, and feature engineering techniques.Familiarity with machine learning algorithms, their underlying mathematical concepts, and their practical applications.Ability to work with structured datasets and solve real-world problems using data-driven approaches.Knowledge of data visualization tools and techniques for effective communication of insights.Excellent problem-solving and communication skills.Ability to work collaboratively in a team environment.",
  "about": "Founded in 2008, Process Point Technologies is a niche IT services company headquartered in USA with offshore development center in India. We are specialized in providing digital transformation architecture, implementation services for AI, ERP, MES, WMS, Mobile, cloud, SOA and BI..",
  "Link": "https://www.linkedin.com/company/pptcorporation/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "6699d898edfb8fa086038525"
  },
  "companyname": "Microsoft",
  "Type": "Machine Learning",
  "Location": "Hybrid",
  "Responsibilities": "Own or lead verification of complex flows at the SOC, subsystem, or IP levels.Learn about the design and interact with partner teams to define verification strategies and test plans.Develop verification environments and run and debug simulations to drive quality.Apply random-stimulus and coverage-based techniques to find bugs and meet test plan goals.innovate to improve verification efficiency through methodologies or tools.Coach and mentor others in your areas of expertise.Demonstrate Microsoft core values: Customer Focus, Adaptability, Collaboration, Growth Mindset, Drive for Results, Influence for Impact, Judgement, and Diversity & Inclusion.Plan the verification of complex design IP/SoC interacting with the architecture and design engineers to identify verification test scenarios...",
  "Qualifications": "15 or more years of experience in design verification with a proven track record of delivering complex CPU or SoC IP’s.Experience with verification for multiple product cycles from definition to silicon, including writing test plans, developing tests,.debugging failures and coverage signoff in UVM or C++.Substantial background in debugging RTL (Verilog) designs as well as simulation and/or emulation environments.Scripting language such as Python or Perl",
  "about": "Microsoft is a highly innovative company that collaborates across disciplines to produce cutting edge technology that changes our world. Microsoft’s Silicon team builds custom silicon for a diverse set of systems ranging from innovative consumer products like Xbox to high-performance Azure cloud servers, clients, and augmented reality.",
  "Link": "https://www.linkedin.com/company/microsoft/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "6699d8f8edfb8fa086038526"
  },
  "companyname": "Cloud Counselage Pvt. Ltd.",
  "Type": "Machine Learning",
  "Location": "Remote",
  "Responsibilities": "Compliance with company policies .Complete task assigned before the deadline .Follow the instructions provided by Supervisor .",
  "Qualifications": "Flexi-time, 3-6 months commitment.Student of Diploma/Graduate/Post Graduate (Technical/Management) courses.Good problem-solving skills.Good Communication Skills.Work independently with minimum supervision.Good knowledge of LLMs and understanding of Deep Learning.Membership (Free) of Industry-Academia Community (If you are not a member already, please Signup/Register for free",
  "about": "Cloud Counselage Pvt. Ltd. are looking for Full-time Interns, with an interest in Machine Learning, who can design and develop machine learning systems, implement appropriate ML algorithms, and conduct experiments..",
  "Link": "https://www.linkedin.com/company/cloud-counselage/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "6699d963edfb8fa086038527"
  },
  "companyname": "UPES.",
  "Type": "Machine Learning",
  "Location": "OnSite",
  "Responsibilities": "Delivering high-quality lectures, seminars, and tutorials. • Developing course materials, including syllabi, assignments, and assessments. • Providing academic support and guidance to students. • Evaluating student performance fairly and providing constructive feedback. • Keeping up to date with developments in the field and integrating them into teaching. • Create and maintain a supportive and inclusive learning environment that facilitates student learning. • Participate in course and curriculum development, including updating and revising course materials and assessments..",
  "Qualifications": "PhD degree in the relevant field , or Ph.d pursuing. • Demonstrated ability to teach effectively at the undergraduate and graduate levels. • A record of scholarly research and publication in the relevant field. • Strong written and verbal communication skills. • Ability to work collaboratively with colleagues within and outside the department.",
  "about": "Applications are invited for the post of Assistant Professor(s) in the School of Computer Science(SoCS) With University Of Petroleum and Energy Studies, Dehradun.We are looking for high-end interdisciplinary research professionals.For more details about UPES & School of Computer Science, visit our website: www.upes.ac.in..",
  "Link": "https://www.linkedin.com/school/upesdehradun/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "6699d9c3edfb8fa086038528"
  },
  "companyname": "Prometrics Solutions",
  "Type": "Machine Learning",
  "Location": "Hybird",
  "Responsibilities": "Write effective, scalable code.Develop back-end components to improve responsiveness and overall performance Integrate user-facing elements into applications.Test and debug programs.Improve functionality of existing systems.Implement security and data protection solutions.Assess and prioritize feature requests.Coordinate with internal teams to understand user requirements and provide technical solutions.",
  "Qualifications": "PhD degree in the relevant field , or Ph.d pursuing. • Demonstrated ability to teach effectively at the undergraduate and graduate levels. • A record of scholarly research and publication in the relevant field. • Strong written and verbal communication skills. • Ability to work collaboratively with colleagues within and outside the department.",
  "about": "Prometrics Solutions , it was established in the year of 2012. with a decade of credence has evolved into a boutique organization with the complete spectrum of People Solutions, offering differentiated solutions to the vibrant & dynamic business needs of the corporates. We draw our strength from the ability to dimension holistic solutions, having a bouquet of products & services integrated on seamless technology & backed by our ability to customize the solutions according to the Client needs..",
  "Link": "https://www.linkedin.com/company/prometricssolutions/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "6699da1aedfb8fa086038529"
  },
  "companyname": "Cloud Counselage Pvt. Ltd.",
  "Type": "Machine Learning",
  "Location": "Hybird",
  "Responsibilities": "Compliance with company policies .Complete assigned tasks before the deadline .Follow the instructions provided by Supervisor ",
  "Qualifications": "Flexi-time, 3-6 months commitment.Student of Diploma/Graduate/Post Graduate (Technical/Management) courses.Good Communication Skills.Good problem-solving skills.Work independently with minimum supervision.Good knowledge of LLMs (open as well as closed source).Membership (Free) of Industry-Academia Community (If you are not a member already, please Signup/Register for free.",
  "about": "Cloud Counselage Pvt. Ltd. are looking for Full-time Interns, with an interest in Artificial Intelligence, who can develop, program and train complex networks of algorithms that make up an AI..",
  "Link": "https://www.linkedin.com/company/cloud-counselage/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "6699da67edfb8fa08603852a"
  },
  "companyname": "EVOASTRA VENTURES PVT LTD",
  "Type": "Machine Learning",
  "Location": "Hybird",
  "Responsibilities": "Work closely with our data science team to support ongoing projects and initiatives.Assist in data collection, cleaning, and analysis.Contribute to the development and implementation of machine learning models.Collaborate with cross-functional teams to deliver actionable insights and solutions.Participate in team meetings and brainstorming sessions to enhance your learning experience ",
  "Qualifications": "Pursuing a degree in Computer Science, Data Science, Statistics, or a related field.Strong analytical and problem-solving skills.Proficiency in programming languages such as Python, R, or SQL.Excellent communication and teamwork abilities.Prior experience with data analysis or machine learning is a plus.",
  "about": "Cloud Counselage Pvt. Ltd. are looking for Full-time Interns, with an interest in Artificial Intelligence, who can develop, program and train complex networks of algorithms that make up an AI..",
  "Link": "https://www.linkedin.com/company/evoastra/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "6699dab1edfb8fa08603852b"
  },
  "companyname": "Softseekers Infotech Private Limited",
  "Type": "Machine Learning",
  "Location": "Remote",
  "Responsibilities": "Work closely with our data science team to support ongoing projects and initiatives.Assist in data collection, cleaning, and analysis.Contribute to the development and implementation of machine learning models.Collaborate with cross-functional teams to deliver actionable insights and solutions.Participate in team meetings and brainstorming sessions to enhance your learning experience ",
  "Qualifications": "Knowledge in AI ML.Strong experience in Back-End Web Development and Software Development.Proficiency in Front-End Development and Cascading Style Sheets (CSS).Full-Stack Development skills.Knowledge of Python and FastAPI.Experience with databases and SQLExperience with version control systems (e.g., Git).Understanding of responsive design principles.Excellent problem-solving and analytical skills.",
  "about": "Softseekers Infotech Private Limited is an IT company specializing in providing businesses worldwide with custom technology solutions. With a team of skilled software developers, Softseekers combines technological expertise, specific domain experience, and a passion for excellence to deliver enterprise-grade solutions. From mobile apps and websites to complex web backend and frontend projects, Softseekers turns ideas into game-changing products across global markets..",
  "Link": "https://www.linkedin.com/company/softseekers-infotech-private-limited/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "6699db10edfb8fa08603852c"
  },
  "companyname": "TechHost Services",
  "Type": "Machine Learning",
  "Location": "Remote",
  "Responsibilities": "Design and develop machine learning models and algorithms using Python. Collaborate with cross-functional teams to integrate machine learning models into production systems. Contribute to the development of data analysis tools and frameworks. Optimize and maintain existing machine learning infrastructure and codebase. Research and implement new machine learning technologies and methodologies. Participate in code reviews and provide constructive feedback to peers. Work closely with data scientists and engineers to understand requirements and deliver robust solutions. Prototype new ideas and solutions quickly. Contribute to the technical documentation and knowledge sharing within the team. Stay updated with the latest developments in the field of machine learning and Python development. ",
  "Qualifications": "Bachelor's degree in Computer Science, Engineering, Mathematics, or related field. Proven experience in Python development, particularly in the implementation of machine learning algorithms. Demonstrated expertise in machine learning, including data preprocessing, feature engineering, and model evaluation. Strong understanding of data structures, algorithms, and software design principles. Experience with data analysis libraries such as NumPy, Pandas, and SciPy. Familiarity with machine learning frameworks such as TensorFlow, Keras, or PyTorch. Proficiency in version control systems, such as Git. Ability to write clean, efficient, and well-documented code. Excellent problem-solving and analytical skills. Good understanding of statistical concepts and their application in machine learning.",
  "about": "Welcome to TechHost Services Private Limited, where We Host Your Needs isn't just a slogan, it's our commitment. As a premier IT and Non-IT staffing consultancy and services provider, we specialize in fulfilling our clients' requirements and hosting their IT infrastructure. Our focus is on delivering high-quality solutions that ensure client satisfaction...",
  "Link": "https://www.linkedin.com/company/techhost-services-privite-limited/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "6699db9eedfb8fa08603852d"
  },
  "companyname": "Le Frehindi Official",
  "Type": "Marketing",
  "Location": "Remote",
  "Responsibilities": "Marketing and Communication skills.Social Media Marketing skills.Web Content Writing skills.Web Analytics skillsExcellent written and verbal communication skills.Creative thinking and problem-solving abilities.Experience in digital marketing or related field.Knowledge of SEO and SEM techniques.Experience with graphic design software is a plus.Bachelor's degree in Marketing, Communications, or related field. ",
  "Qualifications": "Bachelor's degree in Computer Science, Engineering, Mathematics, or related field. Proven experience in Python development, particularly in the implementation of machine learning algorithms. Demonstrated expertise in machine learning, including data preprocessing, feature engineering, and model evaluation. Strong understanding of data structures, algorithms, and software design principles. Experience with data analysis libraries such as NumPy, Pandas, and SciPy. Familiarity with machine learning frameworks such as TensorFlow, Keras, or PyTorch. Proficiency in version control systems, such as Git. Ability to write clean, efficient, and well-documented code. Excellent problem-solving and analytical skills. Good understanding of statistical concepts and their application in machine learning.",
  "about": "Le Frehindi Official is an educational organization located in Dehradun that focuses on empowering youth through global experiences. They offer a wide range of programs, including scholastic tours, exchange programs, summer and winter camps, linguistic expeditions, heritage tours, global language development programs, teachers training programs, youth publications, and poetry workshops. Their mission is to foster personal growth and global citizenship by providing opportunities for young people to expand their horizons...",
  "Link": "https://www.linkedin.com/company/lefrehindiofficial/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "6699dbefedfb8fa08603852e"
  },
  "companyname": "TestGrid.io",
  "Type": "Marketing",
  "Location": "Remote",
  "Responsibilities": "Create and nurture Guest blogging contacts and communicate with them to find high-quality potential guest blogging sites. Develop personalized outreach strategies and build strong relationships with blog owners, editors, and influencers. Backlink Building: Conduct comprehensive backlink analysis to identify opportunities for acquiring high-quality backlinks. Execute outreach strategies to establish relationships with relevant websites and secure backlinks. Monitor and report on the effectiveness of backlink acquisition efforts. Participate in online forums, communities, and Q&A platforms to promote our content and brand. Content Creation & Collaboration: Generate engaging and SEO-optimized content for third-party content-sharing platforms to obtain links and enhance brand visibility. Identify potential partners for content collaboration and guest posting opportunities. ",
  "Qualifications": "Any bachelor’s degree Currently pursuing or recently completed a course in Marketing, Digital Marketing, or a related field. Knowledge of SEO principles and understanding of how search engines operate. Familiarity with off-page SEO techniques, including backlinking strategies & Guest blogging. 0-1 year of experience in SEO or digital marketing through internships, coursework, or personal projects is a plus. Strong communication skills and the ability to work collaboratively within a team. Detail-oriented with a proactive and results-driven mindset.",
  "about": "TestGrid is a leading provider of end-to-end automation cloud and on-premise testing solutions. With a focus on simplifying the testing process, TestGrid's innovative AI-powered technology allows organizations to achieve significant time and cost savings while accelerating their go-to-market strategies..",
  "Link": "https://www.linkedin.com/company/testgrid-io/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "6699dc2fedfb8fa08603852f"
  },
  "companyname": "Cloudstaff",
  "Type": "Marketing",
  "Location": "Remote",
  "Responsibilities": "Conduct online research to gather information on potential leads. Compile and maintain lists of contacts and organizations for outreach. Use various online tools and platforms to identify and verify lead information. Manage and respond to marketing-related support requests from internal and external stakeholders. Create and update marketing materials such as brochures, presentations, and digital content using existing collateral. ",
  "Qualifications": "Any bachelor’s degree Currently pursuing or recently completed a course in Marketing, Digital Marketing, or a related field. Knowledge of SEO principles and understanding of how search engines operate. Familiarity with off-page SEO techniques, including backlinking strategies & Guest blogging. 0-1 year of experience in SEO or digital marketing through internships, coursework, or personal projects is a plus. Strong communication skills and the ability to work collaboratively within a team. Detail-oriented with a proactive and results-driven mindset.",
  "about": "Outsourcing and Offshoring Consulting 5,001-10,000 employees 3,896 on LinkedIn We have over 15 years experience of helping businesses scale and grow through outsourcing - you could say it’s our passion. From the very start, we knew the traditional model for outsourcing was outdated. We believe a combination of the right technology and the right people can overcome any business challenge – it’s been at the heart of everything we do since 2005..",
  "Link": "https://www.linkedin.com/company/cloudstaff/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "6699dc72edfb8fa086038530"
  },
  "companyname": "Pesto Tech",
  "Type": "Marketing",
  "Location": "Remote",
  "Responsibilities": "Conduct keyword research and analysis to identify opportunities for organic growth. Assist in optimizing website content, meta tags, and on-page elements for search engines. Support the creation and implementation of SEO strategies to improve search rankings. Monitor website performance using Google Analytics and Google Search Console. Perform competitive analysis to identify strengths, weaknesses, and opportunities. Collaborate with content creators to ensure SEO best practices are integrated. Help with the development and execution of link-building strategies. Generate regular reports on SEO performance and suggest improvements. Stay updated with the latest SEO trends and algorithm changes.",
  "Qualifications": "Bachelor’s degree in Marketing, Communications, or related field (preferred). Basic understanding of SEO principles and practices. Familiarity with SEO tools such as Google Analytics, Google Search Console, SEMrush, Ahrefs, Moz, etc. Strong analytical and problem-solving skills. Excellent communication skills and ability to work independently. Eagerness to learn and adapt in a fast-paced environment. Attention to detail and a passion for digital marketing.",
  "about": "Outsourcing and Offshoring Consulting 5,001-10,000 employees 3,896 on LinkedIn We have over 15 years experience of helping businesses scale and grow through outsourcing - you could say it’s our passion. From the very start, we knew the traditional model for outsourcing was outdated. We believe a combination of the right technology and the right people can overcome any business challenge – it’s been at the heart of everything we do since 2005..",
  "Link": "https://www.linkedin.com/company/pestotech/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "6699dcbfedfb8fa086038531"
  },
  "companyname": "STRI Academy",
  "Type": "Marketing",
  "Location": "Remote",
  "Responsibilities": "Design and implement comprehensive marketing plans to achieve sales targets and increase enrollment in our online courses. Utilize market research and analysis to identify trends, opportunities, and challenges in the industry. Collaborate with the content team to create compelling marketing materials, including website content, blog posts, email campaigns, and social media content.",
  "Qualifications": "Bachelor's degree in Marketing, Business Administration, or a related field; MBA preferred. Proven experience in marketing management, preferably in the education or e-learning industry. Strong understanding of digital marketing tactics, including SEO, SEM, social media marketing, email marketing, and content marketing. Demonstrated success in developing and executing multi-channel marketing strategies that drive lead generation and sales growth. Experience with marketing automation tools (e.g., HubSpot, Marketo) and CRM software (e.g., Salesforce). Excellent communication skills, both written and verbal, with the ability to effectively collaborate with cross-functional teams. Analytical mindset with the ability to interpret complex data sets and translate findings into actionable insights. Passion for sustainability and knowledge of LEED Certification programs is a plus",
  "about": "STRI Academy offers LEED Green Associate (GA) Certification Training, focused on green building practices and sustainability. Our courses provide a thorough understanding of green building concepts and are designed to help individuals reach new heights in their careers. With a pass rate of 95% on certification exams, our community of achievers embraces opportunities for professional growth and success..",
  "Link": "https://www.linkedin.com/company/striacademy/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "6699dd03edfb8fa086038532"
  },
  "companyname": "Spearmint Technologies",
  "Type": "Marketing",
  "Location": "OnSite",
  "Responsibilities": "SEO Strategy Development: Develop and implement effective search engine optimization (SEO) strategies to improve our website's visibility on search engines. Campaign Coordination: Coordinate with content, design, social media, and pay-per-click (PPC) marketing teams to align strategies and campaigns for maximum impact. Project Management: Manage offsite and onsite optimization projects and regularly report on performance, ensuring continuous improvement and alignment with business goals. Keyword Research: Conduct keyword research to guide content teams and inform content creation, ensuring our website and content are optimized for relevant search queries. Technical SEO: Review technical SEO issues, recommend and implement fixes to improve website performance and rankings. Content Optimization: Optimize website content and landing pages to ensure they are engaging, relevant, and aligned with SEO best practices..",
  "Qualifications": "Bachelor's degree in Marketing, Business Administration, or a related field; MBA preferred. Proven experience in marketing management, preferably in the education or e-learning industry. Strong understanding of digital marketing tactics, including SEO, SEM, social media marketing, email marketing, and content marketing. Demonstrated success in developing and executing multi-channel marketing strategies that drive lead generation and sales growth. Experience with marketing automation tools (e.g., HubSpot, Marketo) and CRM software (e.g., Salesforce). Excellent communication skills, both written and verbal, with the ability to effectively collaborate with cross-functional teams. Analytical mindset with the ability to interpret complex data sets and translate findings into actionable insights. Passion for sustainability and knowledge of LEED Certification programs is a plus",
  "about": "If you are looking for a simple tech solution minter, then Spearmint is definitely the correct answer. Our unrivaled practices for recruiting top people guarantee the most effective resource selection possible, as well as the creation of creative solutions that are both forward-looking and easy to use. We have become the leading service provider with comprehensive business and technology consulting services from start to finish..",
  "Link": "https://www.linkedin.com/company/spearmint-technologies/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "6699dd3aedfb8fa086038533"
  },
  "companyname": "Sparklehood",
  "Type": "Marketing",
  "Location": "OnSite",
  "Responsibilities": "Develop and implement comprehensive digital marketing campaigns to increase brand awareness and engagement. ●Design, build, and maintain BHyve's social media presence through content and blogs ● Analyze campaign performance, report on ROI and KPIs, and adjust strategies based on data-driven insights. ● Identify digital marketing trends and insights, optimizing spend and performance to maximize results. ● Drive innovative growth strategies through digital marketing, staying ahead of industry developments using SEO. ● Conduct experiments and conversion tests to refine digital marketing efforts continually..",
  "Qualifications": "Bachelor's degree in Marketing, Business Administration, or a related field; MBA preferred. Proven experience in marketing management, preferably in the education or e-learning industry. Strong understanding of digital marketing tactics, including SEO, SEM, social media marketing, email marketing, and content marketing. Demonstrated success in developing and executing multi-channel marketing strategies that drive lead generation and sales growth. Experience with marketing automation tools (e.g., HubSpot, Marketo) and CRM software (e.g., Salesforce). Excellent communication skills, both written and verbal, with the ability to effectively collaborate with cross-functional teams. Analytical mindset with the ability to interpret complex data sets and translate findings into actionable insights. Passion for sustainability and knowledge of LEED Certification programs is a plus",
  "about": "The company is at the forefront of transforming organizational efficiency and innovation through our cutting-edge knowledge-sharing platform. We empower businesses to accelerate the onboarding process, enhance employee satisfaction, and foster a culture of continuous learning and collaboration. By facilitating instant access to information and streamlining communication, it drives strategic gains for organizations worldwide. As we expand our impact within the manufacturing and IT sectors, and beyond, we're looking for dynamic individuals to join us in redefining how organizations operate and engage in the digital age..",
  "Link": "https://www.linkedin.com/school/sparklehood/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "6699dd8aedfb8fa086038534"
  },
  "companyname": "Sportskeeda",
  "Type": "Marketing",
  "Location": "OnSite",
  "Responsibilities": "Develop and implement comprehensive digital marketing campaigns to increase brand awareness and engagement. ●Design, build, and maintain BHyve's social media presence through content and blogs ● Analyze campaign performance, report on ROI and KPIs, and adjust strategies based on data-driven insights. ● Identify digital marketing trends and insights, optimizing spend and performance to maximize results. ● Drive innovative growth strategies through digital marketing, staying ahead of industry developments using SEO. ● Conduct experiments and conversion tests to refine digital marketing efforts continually..",
  "Qualifications": "Candidate should be available to work 9 hours per day.Students and part-timers are not recommended to apply.Candidate should have a degree in engineering/MBA or any equivalent field .Experience or certification in SEO/digital marketing will be a plus.Candidate should be a sports fanatic",
  "about": "Fans don't just follow the sport, they feel it. We're one of you, and we strive to keep you on top of every possible sports trend by creating engaging and insightful content at lightning-quick speed. Established in 2009, Sportskeeda is a global sports content platform that covers the world's biggest sports and esports subjects and serves over 80 Million fans every month. Our passionate team comprises top journalists from around the world who produce hundreds of well-researched content pieces on a daily basis..",
  "Link": "https://www.linkedin.com/company/sportskeeda-com/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "6699ddcbedfb8fa086038535"
  },
  "companyname": "Dreamwave AI",
  "Type": "Marketing",
  "Location": "HyBrid",
  "Responsibilities": "Develop and implement comprehensive digital marketing campaigns to increase brand awareness and engagement. ●Design, build, and maintain BHyve's social media presence through content and blogs ● Analyze campaign performance, report on ROI and KPIs, and adjust strategies based on data-driven insights. ● Identify digital marketing trends and insights, optimizing spend and performance to maximize results. ● Drive innovative growth strategies through digital marketing, staying ahead of industry developments using SEO. ● Conduct experiments and conversion tests to refine digital marketing efforts continually..",
  "Qualifications": "Social Media Marketing skills.Excellent written and verbal communication skills.Experience in developing content strategies.Ability to write engaging and effective copy.Bachelor's degree in Marketing, Communications, or related field.Experience in the AI or creative industry is a plus",
  "about": "Dreamwave AI is an AI research lab that utilizes next-generation creative tools to augment human creativity. With a focus on AI-powered technology, Dreamwave AI is at the forefront of innovation in the creative industry..",
  "Link": "https://www.linkedin.com/company/dreamwaveai/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "6699de0bedfb8fa086038536"
  },
  "companyname": "STUVALLEY TECHNOLOGY",
  "Type": "Marketing",
  "Location": "HyBrid",
  "Responsibilities": "Lead Generation.Online Marketing.Digital Marketing campaigns.Subject Matter Familiarization.SEO & SEM.",
  "Qualifications": "Social Media Marketing skills.Excellent written and verbal communication skills.Experience in developing content strategies.Ability to write engaging and effective copy.Bachelor's degree in Marketing, Communications, or related field.Experience in the AI or creative industry is a plus",
  "about": "Stuvalley Technology is a strong and worthy player in the field of training (Academic & Professional) with an extra edge in job placement. we deliver our services from the training of students, and professionals, to job placement under our banner..",
  "Link": "https://www.linkedin.com/company/stuvalley/",
  "employer": "admin@gmail.com"
},
{
  "_id": {
    "$oid": "669a04c8edfb8fa086038537"
  },
  "companyname": "Vidurta",
  "Type": "Human Resources",
  "Location": "HyBrid",
  "Responsibilities": "• Assist with posting job vacancies on job boards, social media, and other platforms.Screen resumes and applications, and schedule interviews with candidates.Conduct reference checks and background screenings as needed.Assist with drafting offer letters and employment contracts.Assist with maintaining accurate and up-to-date recruitment records and data.Assist with purchasing and procurement processes, including conducting research on potential vendors.Maintain accurate and up-to-date procurement records and data.Provide general administrative support to the recruitment and procurement teams as needed",
  "Qualifications": "• A relevant Bachelor's or Master's degree program, such as in Business or Human Resources, is required. An MBA with a specialization in HR is preferred.Excellent organizational and time management skills.Strong attention to detail and ability to multitask.Excellent written and verbal communication skills.Proficient in Microsoft Office (Word, Excel, PowerPoint).Ability to work independently and as part of a team.Experience with recruitment and procurement processes is a plus",
  "about": "Vidurta helps tech-driven companies and IT Recruiters source prevetted highly skilled developers in 1-4 days for rates up to 67% lower than the local market. Having lived in France for 14 years, we know the standards, needs and expectations of our clients. Our senior team is based in Paris, France, just a phone call, taxi or train ride away. The rest of our managers and people are in India, where we source most of our developers..",
  "Link": "https://www.linkedin.com/company/vidurta/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "669a053aedfb8fa086038538"
  },
  "companyname": "YO HR Consultancy",
  "Type": "Human Resources",
  "Location": "HyBrid",
  "Responsibilities": "Utilizing various job portals and social channels such as Naukri, LinkedIn, Indeed, and Shine to source potential candidates. Conducting end-to-end recruitment processes, which involve screening and reviewing resumes, conducting phone screens, and understanding candidate requirements. Advertising job openings on job boards, the company’s careers page, and social media to attract qualified candidates. Effectively managing the candidate database. Demonstrating excellent communication skills to engage effectively with candidates and colleagues. Preferably seeking immediate joiners to fulfill the recruitment needs efficiently.",
  "Qualifications": "The ability to confidently communicate with top management personnel. A thorough understanding of the roles and responsibilities of various job positions. Hands-on experience in sourcing candidates from job portals and social channels like Naukri, LinkedIn, Indeed, and Shine. A self-motivated, proactive, and detail-oriented approach towards recruitment processes.",
  "about": "YO HR CONSULTANCY is a dynamic and fast-growing firm in the None industry, specializing in providing innovative HR solutions to its clients. With a strong focus on delivering quality services, we strive to create a positive impact in the HR domain..",
  "Link": "https://www.linkedin.com/company/yo-hr-consultancy-pvt-ltd/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "669a05bcedfb8fa086038539"
  },
  "companyname": "A1advisor",
  "Type": "Human Resources",
  "Location": "HyBrid",
  "Responsibilities": "Source, screen, and recruit candidates for various IT positions, including software developers, engineers, system administrators, and IT managers. Utilize job boards, social media platforms, networking events, and other channels to attract top talent. Conduct initial phone screenings to assess candidate qualifications, technical skills, and cultural fit. Coordinate and schedule interviews between candidates and hiring managers. Facilitate communication and feedback between candidates and hiring teams throughout the recruitment process. Maintain accurate and up-to-date candidate records in the applicant tracking system (ATS). Build and maintain a strong pipeline of qualified candidates for current and future hiring needs. Collaborate with hiring managers to understand staffing requirements and develop effective recruitment strategies. Stay updated on industry trends, best practices, and innovative recruiting techniques to continuously improve recruitment processes.",
  "Qualifications": "The ability to confidently communicate with top management personnel. A thorough understanding of the roles and responsibilities of various job positions. Hands-on experience in sourcing candidates from job portals and social channels like Naukri, LinkedIn, Indeed, and Shine. A self-motivated, proactive, and detail-oriented approach towards recruitment processes.",
  "about": "Unlock financial success with our expert investment advisory services at A1advisor. Trust our seasoned advisors to navigate markets, tailor strategies to your goals, and secure your financial future. Experience personalized guidance and maximize returns. Invest wisely with A1advisor – where your financial aspirations become reality. 📈💼 #InvestmentAdvisor #FinancialSuccess.",
  "Link": "https://www.linkedin.com/company/a1advisor/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "669a062bedfb8fa08603853a"
  },
  "companyname": "WCPL",
  "Type": "Human Resources",
  "Location": "Remote",
  "Responsibilities": "HR management.Developing HR policies.Managing employee benefits.Personnel management",
  "Qualifications": "Skills in Human Resources (HR) and HR Management.Experience in developing and implementing HR policies.Knowledge of employee benefits and personnel management.Excellent organizational and multitasking abilities.Strong attention to detail.Ability to work independently and remotely.Good communication and interpersonal skills.Enrollment in a degree program related to Human Resources",
  "about": "Wonton Consulting Private Limited is a vibrant startup specializing in human resource services. We are dedicated to transforming the way talent and organizations connect. Founded on the principles of integrity, innovation, and a commitment to excellence, we are passionate about building bridges that shape successful futures..",
  "Link": "https://www.linkedin.com/company/wontonconsulting/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "669a069aedfb8fa08603853b"
  },
  "companyname": "Digi Digital Placement",
  "Type": "Human Resources",
  "Location": "Remote",
  "Responsibilities": "Perform pre-screening calls to analyze applicants’ abilities.Interview candidates combining various methods (e.g. structured interviews, technical assessments and behavioral questions).Coordinate with IT team leaders to forecast department goals and hiring needs.Craft and send personalized recruiting emails with current job openings to passive candidates.Participate in tech conferences and meetups to network with IT professionals.Compose job offer letters.Onboard new hires",
  "Qualifications": "Skills in Human Resources (HR) and HR Management.Experience in developing and implementing HR policies.Knowledge of employee benefits and personnel management.Excellent organizational and multitasking abilities.Strong attention to detail.Ability to work independently and remotely.Good communication and interpersonal skills.Enrollment in a degree program related to Human Resources",
  "about": "Welcome to Digital Placement, a leading staffing company dedicated to connecting businesses with top-tier digital talent. With a deep understanding of the ever-evolving digital landscape, we specialize in providing customized staffing solutions to meet your organization's unique needs At Digital Placement, we recognize that in today's fast-paced and technology-driven world, having the right people with the right skills is crucial for success. Whether you're a small startup, a growing mid-sized company, or a large corporation, our extensive network of highly skilled professionals ensures that we can source the perfect candidates for your digital workforce..",
  "Link": "https://www.linkedin.com/company/dpinnotech/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "669a06f6edfb8fa08603853c"
  },
  "companyname": "ReGraduate",
  "Type": "Human Resources",
  "Location": "Remote",
  "Responsibilities": "Utilize various sourcing methods such as job boards, social media, networking, and employee referrals to identify and attract potential candidates. Develop and maintain a pipeline of qualified candidates for future hiring needs. Review resumes and applications to identify suitable candidates. Conduct initial phone or video interviews to assess candidates' skills, experience, and cultural fit. Schedule and coordinate interviews between candidates and hiring managers. Provide timely feedback to candidates throughout the interview process. Assist hiring managers in developing job descriptions and interview questions. Conduct in-depth interviews and evaluate candidates based on the requirements and competencies of the role.",
  "Qualifications": "Human Resources (HR) skills.Excellent communication and interpersonal skills.Problem-solving and decision-making abilities.Ability to work independently and remotely.Bachelor's degree in Human Resources, Business Administration, or related field",
  "about": "ReGraduate is a Premier Executive search firm providing bespoke advisory services in Executive Search, Leadership hiring and recruitment consulting.We have done mid to senior level hiring for Big tech companies, consulting firms, large MNC banks and Global FMCG players across major cities in India.",
  "Link": "https://www.linkedin.com/company/regraduate/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "669a0730edfb8fa08603853d"
  },
  "companyname": "Female Mentor",
  "Type": "Human Resources",
  "Location": "Remote",
  "Responsibilities": "1. Hiring Interns for different positions. 2. Updating the information of hired candidates. 3. Screening resumes and taking interviews. 4. Post, update, and remove job ads from job boards, careers pages and social networks 5. Address the intern's queries. 6. Review and distribute company policies in digital formats..",
  "Qualifications": "Human Resources (HR) skills.Excellent communication and interpersonal skills.Problem-solving and decision-making abilities.Ability to work independently and remotely.Bachelor's degree in Human Resources, Business Administration, or related field",
  "about": "Female Mentor is a Premier Executive search firm providing bespoke advisory services in Executive Search, Leadership hiring and recruitment consulting.We have done mid to senior level hiring for Big tech companies, consulting firms, large MNC banks and Global FMCG players across major cities in India.",
  "Link": "https://www.linkedin.com/company/the-femalementors/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "669a076eedfb8fa08603853e"
  },
  "companyname": "Peakflo (YC W22)",
  "Type": "Human Resources",
  "Location": "Remote",
  "Responsibilities": "Assist with the recruitment process by identifying candidates, conducting reference checks, and issuing employment contracts. Support the HR department in implementing programs to help improve the employee experience. Help organize and manage new employee orientation, onboarding, and training programs. Assist in the onboarding and offboarding processes. Participate in developing organizational guidelines and procedures. Provide administrative support for HR. Engage in daily HR tasks as required. ",
  "Qualifications": "Bachelor’s degree or currently pursuing a degree in Human Resources, Business Administration, or a related field. Excellent interpersonal and communication skills. Ability to handle data with confidentiality. Good organizational and time management skills. Willingness to learn and to grow with the company. Basic knowledge of labor laws and practices. ",
  "about": "Peakflo with its simple API and one-click ERP integrations, allows businesses to streamline their invoice-to-cash and procure-to-pay processes. 100+ finance teams, from scale-ups to enterprises, use Peakflo each to:.",
  "Link": "https://www.linkedin.com/company/peakflo/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "669a0808edfb8fa08603853f"
  },
  "companyname": "Hyparz",
  "Type": "Human Resources",
  "Location": "Remote",
  "Responsibilities": "Assist with Recruitment Processes: Support the HR team in job postings, scheduling interviews, and maintaining applicant tracking systems. Candidate Sourcing: Utilize various platforms to identify and engage potential candidates. Conducted initial screenings and assisted in shortlisting qualified candidates. Coordinate Interviews: Arrange interview schedules, communicate with candidates and hiring managers, and ensure timely feedback. Administrative Support: Maintain recruitment databases, prepare reports, and handle correspondence related to recruitment activities. Onboarding Support: Assist in the onboarding process by preparing documentation, coordinating orientation schedules, and ensuring a smooth transition for new hires. Compliance: Ensure all recruitment activities comply with company policies and relevant employment laws and regulations. Team Collaboration: Work closely with HR and other departments to meet recruitment goals and support company growth. ",
  "Qualifications": "Experience: Minimum of 1-3 years of experience in recruitment roles. Experience in the tech industry is a plus. Skills: Strong organizational and multitasking abilities. Excellent communication and interpersonal skills. Proficiency in Microsoft Office Suite and familiarity with applicant tracking systems. Attributes: Detail-oriented, proactive, and able to work independently as well as part of a team. High level of discretion and professionalism. ",
  "about": "Hyparz is a remote-first company. We revolutionize the recruitment process to ensure accurate talent alignment, streamlined candidate evaluation, and swift talent integration and provide deeper insights during the hiring process. With a focus on customized recruitment management, Hyparz is dedicated to delivering precision and efficiency in talent acquisition..",
  "Link": "https://www.linkedin.com/company/hyparz/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "669a087cedfb8fa086038540"
  },
  "companyname": "Artmac",
  "Type": "Human Resources",
  "Location": "Remote",
  "Responsibilities": "Develop and implement effective recruitment strategies to attract top-tier Microsoft NopCommerce software developers. Source, screen, and evaluate candidates with extensive experience in Microsoft NopCommerce. Build and maintain a strong pipeline of qualified candidates through various channels, including job boards, social media, and professional networks. Conduct in-depth interviews and assessments to ensure candidates meet the technical and cultural fit requirements of our company. Collaborate with hiring managers to understand project needs and align recruitment efforts with business objectives. Manage the end-to-end recruitment process, from initial contact to offer negotiation and onboarding. Stay updated on industry trends and best practices in tech recruitment and NopCommerce development. ",
  "Qualifications": "Proven experience as a Resourcing Specialist or similar role, preferably in the tech industry. Strong understanding of Microsoft NopCommerce and software development processes. Experience in recruiting for Microsoft NopCommerce software developers. Excellent communication and interpersonal skills. Ability to assess technical skills and cultural fit effectively. Proficient in using recruitment tools and platforms (LinkedIn, job boards, ATS, etc.). Strong organizational and time management skills. Ability to work in a fast-paced and dynamic environment. ",
  "about": "Artmac Infotech is a remote-first company. We revolutionize the recruitment process to ensure accurate talent alignment, streamlined candidate evaluation, and swift talent integration and provide deeper insights during the hiring process. With a focus on customized recruitment management, Hyparz is dedicated to delivering precision and efficiency in talent acquisition..",
  "Link": "https://www.linkedin.com/company/artmac/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "669a096aedfb8fa086038541"
  },
  "companyname": "Marriott Hotels",
  "Type": "Sales Manager",
  "Location": "OnSite",
  "Responsibilities": "Works collaboratively with off-property sales channels to ensure sales efforts are coordinated, complementary and not duplicative. Builds and strengthens relationships with existing and new customers to enable future bookings. Activities include sales calls, entertainment, FAM trips, trade shows, etc. Develops relationships within community to strengthen and expand customer base for sales opportunities. Manages and develops relationships with key internal and external stakeholders. Provides accurate, complete and effective turnover to Event Management.  ",
  "Qualifications": " 4-year bachelor's degree in Business Administration, Marketing, Hotel and Restaurant Management, or related major; 1 year experience in the sales and marketing or related professional area.  ",
  "about": "Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law...",
  "Link": "https://www.linkedin.com/company/marriott_hotels_resorts/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "669a09a6edfb8fa086038542"
  },
  "companyname": "IDFC FIRST Bank",
  "Type": "Sales Manager",
  "Location": "OnSite",
  "Responsibilities": "Ensuring Monthly Sales targets are meet with acquisition in NTB (New to Bank) and ETB (Existing to Bank) customers. Existing liability customers are pitched for Gold loans. Ensure month on month growth in EOP (Execution only platform) Assets for Gold loan business/per branch. Fee Income should be Minimum 1% of total disbursals. Customer Follow ups to be done at regular intervals for timely renewal of cases so as to ensure Minimum renewal pending cases. Co-ordination with valuers to be done time to time basis. Ensure most of the customers are aligned to pay valuation charges as per product norms. Ensuring healthy collections with Nil First equated monthly installment / First presentation Default and minimizing fresh flow in Bucket X. PSL (Priority sector lending) Tagging and should be aware about PSL norms. Helping branch liability team in Audits and ensuring proper communications to customer before any packet Opening. ",
  "Qualifications": " 4-year bachelor's degree in Business Administration, Marketing, Hotel and Restaurant Management, or related major; 1 year experience in the sales and marketing or related professional area.  ",
  "about": "IDFC FIRST Bank stands out as the new-age bank in India, driven by principles of ethical banking, technological innovation, and societal welfare. With a strong commitment to serving customers ethically, the ‘Near and Dear’ Test, assures that our products meet the standards we'd want for our loved ones. We reject unethical income and simplify our offerings, eliminating fees on various services such as Savings Accounts, Debit Cards and transactions, making us the FIRST and only bank in India to do so. Our approach is customer-centric, with transparent and user-friendly products, levelling up the industry standards...",
  "Link": "https://www.linkedin.com/company/idfcfirstbank/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "669a09dfedfb8fa086038543"
  },
  "companyname": "Hyatt Regency",
  "Type": "Sales Manager",
  "Location": "OnSite",
  "Responsibilities": "You will be responsible to assist with the efficient running of the department in line with Hyatt International's Corporate Strategies and brand standards, whilst meeting employee, guest and owner expectations. The Sales Manager is responsible to act as a sales specialist and be responsible to ensure the related revenue is maximised in the most profitable way in line with the agreed targets.",
  "Qualifications": "Ideally with a relevant degree or diploma in Hospitality or Tourism management. Minimum 2 years work experience as Sales Manager or Sales Executive. Good problem solving, administrative and interpersonal skills are a must. ",
  "about": "Welcome to Hyatt Regency hotels, where connections flow seamlessly whether you’re traveling for business or leisure. With more than 150 hotels in over 30 countries, Hyatt Regency is a welcome place for convention goers, business travelers, and leisure seekers alike...",
  "Link": "https://www.linkedin.com/company/hyatt-regency/",
  "employer": "muskan@gmail.com"
},
{
  "_id": {
    "$oid": "669a0a29edfb8fa086038544"
  },
  "companyname": "Westin Hotels & Resorts",
  "Type": "Sales Manager",
  "Location": "OnSite",
  "Responsibilities": "Works collaboratively with off-property sales channels to ensure sales efforts are coordinated, complementary and not duplicative. Builds and strengthens relationships with existing and new customers to enable future bookings. Activities include sales calls, entertainment, FAM trips, trade shows, etc. Develops relationships within community to strengthen and expand customer base for sales opportunities. Manages and develops relationships with key internal and external stakeholders. Provides accurate, complete and effective turnover to Event Management. ",
  "Qualifications": "4-year bachelor's degree in Business Administration, Marketing, Hotel and Restaurant Management, or related major; 1 year experience in the sales and marketing or related professional area.  ",
  "about": "No matter what obstacles travel puts between you and your well-being, Westin’s signature wellness programs help you soar above it all. Discover over 200 locations around the globe where you can eat, sleep, move, feel, work and play well, transcending the rigors of travel while you’re on the road. Stay well at Westin Hotels & Resorts, a place where together, we can rise..",
  "Link": "https://www.linkedin.com/company/westin-hotels-&-resorts/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "669a0a82edfb8fa086038545"
  },
  "companyname": "Canopus Infosystems Pvt. Ltd.",
  "Type": "Sales Manager",
  "Location": "Remote",
  "Responsibilities": " Identify Potential Clients: Research and identify potential clients in the overseas market, establish contact, and build lasting relationships. - Market Research: Conduct market research to uncover new business opportunities and stay informed about the competitive landscape. - Team Management: Lead and mentor a team of 6-8 sales professionals, providing guidance, support, and ongoing training to ensure their success. -Client Engagement: Travel to meet client partners, generate sales, and secure new business opportunities. Represent the company at industry events, conferences, and networking opportunities. -Strategic Advisor: Act as a strategic advisor for launching new business units. -Revenue Growth: Develop a roadmap to increase revenue annually with existing clients and new client partners. - Client Development Strategy: Develop and implement a client development strategy to achieve sales targets and meet company goals. This includes setting sales targets, forecasting revenue, and creating action plans. ",
  "Qualifications": "Proven experience in sales and business development in the IT industry. Proven experience in successfully onboarding projects in Data engineering and Data Analytics. - Strong knowledge of Data Engineering, Data Analytics, BI Services, SAP, and other niche technologies and industry solutions. - Excellent communication and interpersonal skills. - Ability to build and maintain relationships with clients. - Strong negotiation and presentation skills. - Result-oriented mindset with a drive for achieving sales targets. - Knowledge of the latest industry trends and developments.  ",
  "about": "Canopus, an ISO/IEC 27001:2013 Company founded in 2011, is a leading 360 degree solutions provider specialized in: - Outsourced software development services - US Staffing with contractual, permanent and temporary workforce solutions - Operational Support - Data Processing and Infrastructure : Data Extraction, ETL Processes, Data Engineering - Data Warehouse, On-Premise and Cloud Storage - Business Data Migration Services - Data Analytics, Reporting, Business Intelligence, Data Governance - Digital Transformation Strategic Partnership - Cloud Transformation Strategic Partnership (AWS, Google, Azure).",
  "Link": "https://www.linkedin.com/company/canopus-infosystems-pvt-ltd/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "669a0abfedfb8fa086038546"
  },
  "companyname": "ICICI Lombard.",
  "Type": "Sales Manager",
  "Location": "OnSite",
  "Responsibilities": "Sales of Health policies through the agency model. Recruit, train agents, and drive business generation in the assigned territory. Ensure licensing and regular activation tracking of agents. Coordinate with various departments including Underwriting, Claims, and Operations. Maintain regular communication with agents, Lead Providers, and intermediaries while keeping organized records. ",
  "Qualifications": "Proven experience in sales and business development in the IT industry. Proven experience in successfully onboarding projects in Data engineering and Data Analytics. - Strong knowledge of Data Engineering, Data Analytics, BI Services, SAP, and other niche technologies and industry solutions. - Excellent communication and interpersonal skills. - Ability to build and maintain relationships with clients. - Strong negotiation and presentation skills. - Result-oriented mindset with a drive for achieving sales targets. - Knowledge of the latest industry trends and developments.  ",
  "about": "ICICI Lombard is the leading private general insurance company in the country. The Company offers a comprehensive and well-diversified range of products through multiple distribution channels, including motor, health, crop, fire, personal accident, marine, engineering, and liability insurance. With a legacy of over 2 decades, ICICI Lombard is committed to customer centricity with its brand philosophy of ‘Nibhaaye Vaade’. The company has issued over 36.2 million policies, honoured over 2.9 million claims and has a Gross Written Premium (GWP) of ₹ 255.94 billion for the year ended March 31, 2024. ICICI Lombard has 312 branches and 13,670 employees, as on March 31, 2024.",
  "Link": "https://www.linkedin.com/company/icici-lombard/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "669a0b38edfb8fa086038547"
  },
  "companyname": "Propix Technologies.",
  "Type": "Sales Manager",
  "Location": "OnSite",
  "Responsibilities": " Analysing the market for our product along with different industries. Ø Capturing new area to market our product. Ø Targeting new Customers from different industries. Ø Getting business from New Customer Ø Retain existing Customers and take new product business from them Ø Managing, training and motivating existing sales team to drive revenue growth Ø Develop and manage efficient distribution networks for sales Ø Develop efficient and creative sales and marketing strategies for the assigned territory and target setting for the sales team Ø Collecting customer and market feedback and reporting the same. ",
  "Qualifications": "M. Pharm, M. M.S.(Marketing), MBA Marketing Experience: • 3 – 8 years of Experience. • Experience in Packaging &/or Pharma industry is preferred. Skills: • Marketing & Sales • Corporate & Marketing Leadership . • Customer Relations Development for Business Generation. • Training Marketing Team. • Corporate Strategic Planning. • Timely Achieving of Qualitative & Quantitative Goals . • Meeting Timelines as planned.  ",
  "about": "Propix Technologies is a global leader in Track and Trace solutions, Machine Vision systems and Software solutions for Robotics, Optics and Illumination. With over 2 decades of experience and expertise in traceability and automation systems, Propix has over 1700 installations worldwide, offices in 5 countries (India, Dubai UAE, Germany, Canada and Brazil) and a large distribution network.",
  "Link": "https://www.linkedin.com/company/propix-technologies-private-limited/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "669a0be2edfb8fa086038548"
  },
  "companyname": "DP World",
  "Type": "Sales Manager",
  "Location": "Remote",
  "Responsibilities": " Responsible for month-on-month growth of location sales.Ensuring timely submission of invoices and collection from all clients.Client relationship and retention.Ensuring proper warehouse management from Operations team and timely meeting with them to sort out issues (if any) ",
  "Qualifications": "Prior logistics / warehousing experience preferred.Excellent interpersonal and negotiation skills.Willingness to roll up your sleeve.Strong balance of planning and hustling.Previous start-up experience (preferred).",
  "about": "Trade is the lifeblood of the global economy, creating opportunities and improving the quality of life for people around the world. DP World exists to make the world’s trade flow better, changing what’s possible for the customers and communities we serve globally..",
  "Link": "https://www.linkedin.com/company/dp-world/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "669a0c32edfb8fa086038549"
  },
  "companyname": "Beyondriffs",
  "Type": "Sales Manager",
  "Location": "Remote",
  "Responsibilities": "Lead Generation: Actively seek out potential students through various channels, including online research, social media, and outbound outreach. Sales & Conversion: Conduct engaging product demonstrations, effectively address student inquiries, and convert leads into enrollments. Customer Relationship Building: Foster strong relationships with potential and enrolled students, providing exceptional customer service and support. Market Insights: Contribute to market research by gathering data on trends, competitor analysis, and student preferences. Sales Support: Assist the sales team with administrative tasks, data management, and reporting. ",
  "Qualifications": "Passion for music and the education industry.Strong communication and interpersonal skills.Enthusiasm for sales and a results-oriented mindset.Proficiency in computer skills, including CRM software and Microsoft Office Suite.Ability to work independently and collaboratively",
  "about": "Beyondriffs is more than just music lessons - it's a gateway to self-expression, joy, and lifelong fulfillment. We provide high-quality instrument instruction for all ages and skill levels, empowering individuals to discover their musical potential..",
  "Link": "https://www.linkedin.com/company/beyondriffs/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "669a0c76edfb8fa08603854a"
  },
  "companyname": "Marquee Equity",
  "Type": "Sales Manager",
  "Location": "Remote",
  "Responsibilities": "Handle inbound interest and leads, facilitating online demos.Research prospects for effective sales calls.Conduct online demos and convert prospects into customers.Ensure well-organized and impactful product demos.Understand customer needs and propose suitable Marquee products.Manage ongoing customer relationships.Implement strategic follow-ups through calls, texts, and emails.Strive to achieve sales targets.Collaborate on strategic alliances, potentially travelling to various financial centres globally",
  "Qualifications": "Passion for music and the education industry.Strong communication and interpersonal skills.Enthusiasm for sales and a results-oriented mindset.Proficiency in computer skills, including CRM software and Microsoft Office Suite.Ability to work independently and collaboratively",
  "about": "Marquee Equity is more than just music lessons - it's a gateway to self-expression, joy, and lifelong fulfillment. We provide high-quality instrument instruction for all ages and skill levels, empowering individuals to discover their musical potential..",
  "Link": "https://www.linkedin.com/company/marquee-equity/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "669a0cfaedfb8fa08603854b"
  },
  "companyname": "Microsoft",
  "Type": "IT Support",
  "Location": "HyBrid",
  "Responsibilities": "You review, investigate and solve customer technical issues, collaborating within and across teams and leveraging troubleshooting tools and practices. You participate in communities with peer delivery roles. You develop specific technical and professional proficiency to enable you to understand and resolve customer issues, through training and readiness. You identify potential product defects and provide feedback to more senior engineers, contributing to Microsoft product improvements.",
  "Qualifications": "3+ years technical support, technical consulting experience, or information technology experience OR Bachelor's Degree in Computer Science, Information Technology (IT), or related field AND 1+ year(s) technical support, technical consulting experience, or information technology experience.Knowledge of Big Data concepts such as structured data vs unstructured data vs semi structured data.Experience in Extract Transform Load (ETL) / Extract Load Transform (ELT) pipelines.Expertise in Microsoft Azure Data Factory (ADF),.Networking and SQL Server Integration Services (SSIS) preferred.Fundamental awareness of Private, Hybrid and Public Cloud. Any Azure certification is a plus",
  "about": "Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process,.",
  "Link": "https://www.linkedin.com/company/microsoft/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "669a0d6aedfb8fa08603854c"
  },
  "companyname": "Apex Systems",
  "Type": "IT Support",
  "Location": "OnSite",
  "Responsibilities": "Capacity and Performance Management.Working with development teams for take-on and training of new services or significant upgrades.Providing support for Audits (internal and external).takeholder management, working closely with Business and Operations partners to understand KPI metrics to measure service stability to prioritize defect fixes and enhancements ",
  "Qualifications": "5+ years of relevant IT experience (Production Support, ITIL, Release Support, Technical Implementations, or equivalent). Demonstrate flexibility, navigate ambiguity, and quickly establish credibility among technical peers. Excellent written and verbal communication skills (English). Proven knowledge in some or all of the following: Java/J2EE – Core Java, JDBC, EJB, & Java Web Services & Experience in Server-side technologies - SOAP/Restful services, XML/XSLT, XML, JDBC, AOP, MQ Micro Services & MuleSoft. Good knowledge of Middleware components such as Message Broker, IBM Websphere MQ, JBoss application server, MuleSoft. Strong operating system knowledge in Unix and Windows including strong scripting skills.",
  "about": "Apex Systems is an equal opportunity employer. We do not discriminate or allow discrimination on the basis of race, color, religion, creed, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), age, sexual orientation, gender identity, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, disability, status as a crime victim, protected veteran status, political affiliation, union membership, or any other characteristic protected by law.",
  "Link": "https://www.linkedin.com/company/apex-systems/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "669a0dd4edfb8fa08603854d"
  },
  "companyname": "CornerTree",
  "Type": "IT Support",
  "Location": "OnSite",
  "Responsibilities": " To respond to customer and internal staff queries over the telephone, via remote. access or via email promptly in a professional and timely manner.  To follow up on customer enquiries appropriately.  To analyse issues, identify the cause and provide customer centric solutions to resolve system and process issues.  Striving to improve Customer Experience by providing accurate and timely resolution.  Consistently achieving KPI targets.  To assess severity of issues based on the procedures to appropriately utilise expert internal resources and escalate to management team ",
  "Qualifications": " Excellent English oral and written communication skills.  Problem solving skills.  Ability to prioritise and manage workloads.  Attention to detail.  Ability to work both independently and as part of a team.  Experience using Microsoft Office.  Experience and training in troubleshooting and providing support..",
  "about": "CornerTree Consulting is a People, Technology and Innovation Company. Our true belief is adaptive & skilled workforce with scalable technology solutions are the 2 most important ingrediants of business success today.",
  "Link": "https://www.linkedin.com/company/cornertreeconsulting/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "669a0e24edfb8fa08603854e"
  },
  "companyname": "CodeQuantic",
  "Type": "IT Support",
  "Location": "OnSite",
  "Responsibilities": " To respond to customer and internal staff queries over the telephone, via remote. access or via email promptly in a professional and timely manner.  To follow up on customer enquiries appropriately.  To analyse issues, identify the cause and provide customer centric solutions to resolve system and process issues.  Striving to improve Customer Experience by providing accurate and timely resolution.  Consistently achieving KPI targets.  To assess severity of issues based on the procedures to appropriately utilise expert internal resources and escalate to management team ",
  "Qualifications": "Strong knowledge and experience in IT systems and infrastructure. Proficiency in hardware and software installations and troubleshooting. Ability to provide technical support and resolve IT issues. Knowledge of IT security and data protection. Excellent problem-solving and communication skills. Bachelor's degree or higher in Information Technology or a related field. Relevant certifications (e.g., CompTIA A+, Microsoft Certified IT Professional) are a plus. Experience with cloud computing and network administration is a plus..",
  "about": "CodeQuantic Consulting is a People, Technology and Innovation Company. Our true belief is adaptive & skilled workforce with scalable technology solutions are the 2 most important ingrediants of business success today.",
  "Link": "https://www.linkedin.com/company/quanticsolutions/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "669a0e77edfb8fa08603854f"
  },
  "companyname": "HCLTech",
  "Type": "IT Support",
  "Location": "Remote",
  "Responsibilities": " To respond to customer and internal staff queries over the telephone, via remote. access or via email promptly in a professional and timely manner.  To follow up on customer enquiries appropriately.  To analyse issues, identify the cause and provide customer centric solutions to resolve system and process issues.  Striving to improve Customer Experience by providing accurate and timely resolution.  Consistently achieving KPI targets.  To assess severity of issues based on the procedures to appropriately utilise expert internal resources and escalate to management team ",
  "Qualifications": "Strong Unix background.Scripting experience (Shell/Python).Experience in Linix Commands & OS Troubleshooting Linux - RHEL - Commands to Run. Not exactly for System Adminstrator.Build-deploy automation and configuration experience within the Linux and Unix environment.AppDynamics experience.Splunk experience.",
  "about": "HCLTech is a global technology company, home to more than 219,000 people across 60 countries, delivering industry-leading capabilities centered around digital, engineering, cloud and AI, powered by a broad portfolio of technology services and products. We work with clients across all major verticals, providing industry solutions for Financial Services, Manufacturing, Life Sciences and Healthcare, Technology and Services, Telecom and Media, Retail and CPG, and Public Services. Consolidated revenues as of 12 months ending June 2024 totaled $13.4 billion. To learn how we can supercharge progress for you, visit hcltech.com..",
  "Link": "https://www.linkedin.com/company/hcltech/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "669a0f00edfb8fa086038550"
  },
  "companyname": "Influnance",
  "Type": "IT Support",
  "Location": "Remote",
  "Responsibilities": "Develop and maintain Telegram bots. Manage and optimize Telegram channels. Participate in technical research and application related to the Telegram ecosystem. Collaborate with the team to develop and implement technical solutions. Provide technical support and solve related technical issues. ",
  "Qualifications": "Familiar with the Telegram ecosystem and understand Telegram API and related technologies, 2-5 years of experience in developing Telegram bots, capable of independently developing and maintaining Telegram bots(You will not be hired if you dont have enough relevant experience in this, consider before you submit). Experience in managing Telegram channels, capable of effectively operating and promoting Telegram channels. Proficient in at least one backend programming language, such as Node.js, Go, or Python. Good programming habits and code quality awareness. Excellent communication skills and team spirit.",
  "about": "At Influnance, we're revolutionizing the way brands and influencers connect and collaborate. Our innovative platform is designed to streamline the influencer marketing process, offering both sides a seamless, efficient, and effective partnership experience..",
  "Link": "https://www.linkedin.com/company/influnance/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "669a0f6bedfb8fa086038551"
  },
  "companyname": "Gusti Leder GmbH",
  "Type": "IT Support",
  "Location": "Remote",
  "Responsibilities": "Helping colleagues with daily IT problems.Answer and help on #it-helpdesk for Gusti and Stores.Needs to do daily fast tasks and longer projects without losing the track on everything, proper prioritizing, giving updates to TL.Check IT saftey with passwords",
  "Qualifications": "Experience in first level of IT Support.Basic Knowledge and experience in programming.Flexible to work on Saturday if required.Proactive and independent",
  "about": "Gusti Leder stands for more than just the beauty of natural leather products. We actively support the principles of slow fashion by investing in transparent production and the creation of items that are both durable and timeless. Our close and trusting collaboration with local producers allows us to maintain the highest standards of quality and ethical responsibility. With initiatives such as the ability to make each product unnique.",
  "Link": "https://www.linkedin.com/company/gusti-leder-stores-gmbh/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "669a0fb7edfb8fa086038552"
  },
  "companyname": "Bright Tier Solutions",
  "Type": "IT Support",
  "Location": "Remote",
  "Responsibilities": " Supporting the Service Delivery Manager, taking responsibility for the day-to-day operations of managing incidents and service request tickets raised by external customers as well as tickets raised by internal Customer's employees and systems from creation, through assignment to closure. Perform diagnostics of tickets and their status by client and other criteria. Assign tickets to support resources based on client, ticket type, ticket priority, assigned support resources. Provide customer-focused 1st line support as part of a team aiming to resolve issues at the first point of contact. Provide ticket analysis, reporting, and follow up based on Service Level Agreements (ticket response and resolution times). Preparing Client Service Reports in line with agreed formats. Collation of internal KPI metrics in line with agreed formats.",
  "Qualifications": "Experience in first level of IT Support.Basic Knowledge and experience in programming.Flexible to work on Saturday if required.Proactive and independent",
  "about": "Welcome to Bright Tier Solutions, where innovation meets excellence in the world of IT staffing solutions. As a dynamic and forward-thinking staffing startup based in the USA, we specialize in providing top-notch talent for SAP, Cloud Infrastructure consultants, and ServiceNow developers.",
  "Link": "https://www.linkedin.com/company/brighttier/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "669a10b6edfb8fa086038553"
  },
  "companyname": "SmasHR Global",
  "Type": "IT Support",
  "Location": "HyBrid",
  "Responsibilities": " As a Technical Support Engineer, you will resolve complex technical issues in a fast-paced, customer critical environment, working on improving processes, standardsand strategies to perfect our Support Services.",
  "Qualifications": "Customer facing experience providing Technical support/ Customer support to.English speaking customers.Know-how of HTML, running API calls using CURL and REST client, Kibana,.Postman, Jira, FTP client.1 to 2+ years of experience working with SaaS based product company.handling international customers over voice, chat and emails.Fluency in English- reading, writing and speaking",
  "about": "At SmasHR Global We carry out the business of providing manpower placement and recruiting, selecting, interviewing, training, and employing all types of executives, middle management staff, junior level staff, workers, and laborers skilled/unskilled required by various industries and organizations including providing security services, labor contractors, industrial, commercial, housing and other security services and workers for office management and to conduct employment bureau and to provide consultancy and other services in connection with requirements of persons and manpower supply in India and abroad.",
  "Link": "https://www.linkedin.com/company/smashr-global/",
  "employer": "Tanveerkukreja8@gmail.com"
},
{
  "_id": {
    "$oid": "669a1108edfb8fa086038554"
  },
  "companyname": "Cloud Counselage Pvt. Ltd.",
  "Type": "IT Support",
  "Location": "Remote",
  "Responsibilities": "Compliance with company policies .Complete task assigned before the deadline .Follow the instructions provided by Supervisor .",
  "Qualifications": "Flexi-time, no pressure 1.5/2/3 months commitment (min. 1.5/2/3 hrs daily on flexi-time basis),Student of Diploma/Graduate/Post Graduate (Technical/Management) courses.Good problem-solving skills, strong communication, and project management skills.Work independently with minimum supervision.Domain knowledge of the field chosen for the internship.Membership (Free) of Industry-Academia Community (If you are not a member already, please Signup/Register for free",
  "about": "At SmasHR Global We carry out the business of providing manpower placement and recruiting, selecting, interviewing, training, and employing all types of executives, middle management staff, junior level staff, workers, and laborers skilled/unskilled required by various industries and organizations including providing security services, labor contractors, industrial, commercial, housing and other security services and workers for office management and to conduct employment bureau and to provide consultancy and other services in connection with requirements of persons and manpower supply in India and abroad.",
  "Link": "https://www.linkedin.com/company/cloud-counselage/",
  "employer": "Tanveerkukreja8@gmail.com"
}]